/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50709
 Source Host           : localhost
 Source Database       : hslib

 Target Server Type    : MySQL
 Target Server Version : 50709
 File Encoding         : utf-8

 Date: 09/04/2018 08:28:55 AM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `hslib_book_class`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_book_class`;
CREATE TABLE `hslib_book_class` (
  `book_id` int(11) NOT NULL,
  `class_id` varchar(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='书本所属类别表';

-- ----------------------------
--  Table structure for `hslib_book_collect`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_book_collect`;
CREATE TABLE `hslib_book_collect` (
  `c_list_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '收藏清单id',
  `book_id` int(255) DEFAULT NULL COMMENT '书id',
  `person_id` int(11) DEFAULT NULL COMMENT '人id',
  `collect_status` varchar(255) DEFAULT NULL COMMENT '收藏状态：',
  `collect_desc` varchar(255) DEFAULT NULL COMMENT '收藏描述',
  PRIMARY KEY (`c_list_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='图书收藏表';

-- ----------------------------
--  Table structure for `hslib_book_comment`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_book_comment`;
CREATE TABLE `hslib_book_comment` (
  `comment_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '反馈表id',
  `person_id` int(11) DEFAULT NULL COMMENT '人员id',
  `book_id` int(11) DEFAULT NULL COMMENT '书本id',
  `comment_status` varchar(255) DEFAULT NULL COMMENT '反馈状态',
  `marks` varchar(5) DEFAULT ' ' COMMENT '分数',
  `comments` varchar(255) DEFAULT NULL COMMENT '评论',
  `if_best` varchar(255) DEFAULT NULL COMMENT '是否最佳评论',
  PRIMARY KEY (`comment_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='反馈信息表';

-- ----------------------------
--  Records of `hslib_book_comment`
-- ----------------------------
BEGIN;
INSERT INTO `hslib_book_comment` VALUES ('1', '3', '1', ' ', '6.5', '这本书还是不错的', ' ');
COMMIT;

-- ----------------------------
--  Table structure for `hslib_book_liked`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_book_liked`;
CREATE TABLE `hslib_book_liked` (
  `a_list_id` int(11) NOT NULL COMMENT '点赞推荐主id',
  `person_id` int(11) DEFAULT NULL COMMENT '人员id',
  `book_id` int(11) DEFAULT NULL COMMENT '书本ID',
  `approved` varchar(255) DEFAULT NULL COMMENT '是否喜爱，推荐',
  `recommend` varchar(255) DEFAULT NULL COMMENT '推荐',
  `recommend_desc` varchar(255) DEFAULT NULL COMMENT '推荐描述',
  PRIMARY KEY (`a_list_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='喜爱推荐表';

-- ----------------------------
--  Table structure for `hslib_book_tree`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_book_tree`;
CREATE TABLE `hslib_book_tree` (
  `class_id` varchar(11) NOT NULL,
  `sub_classid` varchar(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='分类层级表。';

-- ----------------------------
--  Table structure for `hslib_book_wanted`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_book_wanted`;
CREATE TABLE `hslib_book_wanted` (
  `w_list_id` int(11) NOT NULL COMMENT '清单id',
  `person_id` int(11) DEFAULT NULL,
  `status` varchar(255) DEFAULT NULL COMMENT '0-建立想看；1-正在处理；2-完成处理',
  `book_name` varchar(255) DEFAULT NULL COMMENT '书名',
  `description` varchar(255) DEFAULT NULL COMMENT '描述',
  PRIMARY KEY (`w_list_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='想看清单表';

-- ----------------------------
--  Table structure for `hslib_books`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_books`;
CREATE TABLE `hslib_books` (
  `book_id` int(255) NOT NULL AUTO_INCREMENT COMMENT '书id',
  `booksets_id` int(255) DEFAULT NULL COMMENT '书集id',
  `book_no` varchar(255) DEFAULT NULL COMMENT '图书编码',
  `on_off_shelf` varchar(255) DEFAULT NULL COMMENT '上下架',
  `updatetime` datetime DEFAULT NULL COMMENT '时间',
  `operator` int(10) DEFAULT NULL COMMENT '最后操作员id',
  `order_status` varchar(2) DEFAULT NULL COMMENT '每一个明细的书都有一个状态',
  PRIMARY KEY (`book_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='图书表，主体表。';

-- ----------------------------
--  Records of `hslib_books`
-- ----------------------------
BEGIN;
INSERT INTO `hslib_books` VALUES ('1', '174', 'HS-001', '0', '2018-08-30 00:07:11', '1', '1'), ('2', '174', 'HS-002', '0', '2018-08-30 00:07:29', '1', '0'), ('3', '174', 'HS-003', '0', '2018-08-30 00:07:34', '1', '0');
COMMIT;

-- ----------------------------
--  Table structure for `hslib_booksets`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_booksets`;
CREATE TABLE `hslib_booksets` (
  `booksets_id` int(11) NOT NULL AUTO_INCREMENT,
  `book_name` varchar(255) DEFAULT NULL COMMENT '书名',
  `author` varchar(255) DEFAULT NULL COMMENT '作者',
  `class_id` int(255) DEFAULT NULL COMMENT '分类ID',
  `picture` varchar(255) DEFAULT NULL COMMENT '图片路径',
  `description` varchar(255) DEFAULT NULL COMMENT '书本描述',
  `is_recommend` varchar(255) DEFAULT NULL COMMENT '首页1，图书借阅2',
  `update_time` datetime DEFAULT NULL COMMENT '更新时间',
  `total_amount` int(4) DEFAULT NULL COMMENT '书本总数量',
  `left_amount` int(4) DEFAULT NULL COMMENT '剩余可借出数量',
  `on_off_shelf` varchar(2) DEFAULT ' ' COMMENT '书籍 是否上架 0 上架  1 不上架',
  PRIMARY KEY (`booksets_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=256 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
--  Records of `hslib_booksets`
-- ----------------------------
BEGIN;
INSERT INTO `hslib_booksets` VALUES ('1', '伏天氏', '净无痕', null, '/image/8/8568/8568s.jpg', '东方神州，有人皇立道统，有圣贤宗门传道，有诸侯雄踞一方王国，诸强林立，神州动乱千万载，执此之时，一代天骄叶青帝及东凰大帝横空出世，斩人皇，驭圣贤，诸侯臣服，东方神州一统！然，叶青帝忽然暴毙，世间雕像尽皆被毁，于世间除名，沦为禁忌；从此神州唯东凰大帝独尊！十五年后，东海青州城，一名为叶伏天的少年，开启了他的传奇之路…', null, '2018-09-01 17:41:25', '3', '3', '0'), ('2', '圣墟', '辰东', null, '/image/11/11850/11850s.jpg', '在破败中崛起，在寂灭中复苏。沧海成尘，雷电枯竭……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('3', '纯阳武神', '十步行', null, '/image/16/16279/16279s.jpg', '一个妖魔横行的世界，一个属于武道的大汉天朝。     在这里，流云铁袖可以吞纳风云，降龙十八掌可以撼山断岳，九字真言可以降妖伏魔，太极拳剑可以扭动乾坤。     一个因天朝武库失窃，而被遣送至武当的重犯次子。     一口因故蒙尘，自封于解剑石后的玄虚刀。     当诸强的后代斩断传承，破碎虚空的大门掀开混沌。     这是属于一个骑乘龙首的蝼蚁传说，长生不死的武林神话！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('4', '万界天尊', '血红', null, '/image/16/16662/16662s.jpg', '天为何物？高高在上，威严莫测，是法则，是戒律，是无情，是冷酷。天意，何也？俯瞰众生，操持风云，褫夺赏罚，随性而为。故，天意不可测，苍天不可近。顺之应之，未必得其利；逆之叛之，福祸却难定。天，禁锢万物如深井，红尘众生如烂泥。有这么一只很单纯、很坚定的井底之蛙，谨慎守护着心头那一点小小的微弱的光，带着一定要咬一块天鹅肉的微薄信念，一步步从红尘烂泥中挣扎而出，一步步走出深不见底的污秽深井。他张开大嘴向心中的天鹅咬上去的时候，不小心将这一方苍天也一口吞下！楚天说，欠钱的，要还钱；欠命的，要偿命。这就是楚天认定的最', null, '2018-09-01 17:41:25', '3', '3', '0'), ('5', '斗战狂潮', '骷髅精灵', null, '/image/0/703/703s.jpg', '双月当空，无限可能的英魂世界     孤寂黑暗，神秘古怪的嬉命小丑     百城联邦，三大帝国，异族横行，魂兽霸幽     这是一个英雄辈出的年代，人类卧薪尝胆重掌地球主权，孕育着进军高纬度的野望！     重点是……二年级的废柴学长王同学，如何使用嬉命轮盘，撬动整个世界，伙伴们，请注意，学长来了！！！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('6', '灭世魔帝', '沉默的糕点', null, '/image/12/12134/12134s.jpg', '大三男生兰陵被流星砸中，穿越异世，被索氏家族女武士所救。     仿佛是天意，他和天水城少主索伦长得很像，而这个纨绔已经死于非命。     为了报救命之恩，主角答应冒充少主索伦，去继承天水城主之位。     于是，他面对的是一个风雨飘摇，濒临灭亡的家族。一个国色天香的寡妇姐姐，一笔天文数字的嫖资和赌债，还有近三位数的女友和情人。     兰陵感觉到压力山大。     ……     PS：本人入行12年，出版百多册，这是我的第八本书，之前全部完本。前有《九阳剑圣》《机战皇》全部是万订精品，请放心阅读。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('7', '神门', '薪意', null, '/image/2/2794/2794s.jpg', '这是一个诡异莫名的世界……     山，水，石，花，草，树，木，太阳，月亮，星辰……天地万物都是力量的来源。     这里有着前世所有的经典名著，但却有了一个新的名字《道典》！     原来看书就能获得力量啊？方正直很纠结，那么我是先看《道德经》《奇门遁甲》《论语》还是看……《金瓶梅》《西厢记》啊？     以《道典》为根基，掌万物之道，打开成神之门！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('8', '权谋：升迁有道', '苍白的黑夜', null, '/image/15/15181/15181s.jpg', '走一步，看两部，谋三步，在步步惊心的官场，如何披荆斩棘，红颜相伴，看一个亦步亦趋的秘书，如何一步步打造属于自己的辉煌。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('9', '唐朝小闲人', '南希北庆', null, '/image/14/14969/14969s.jpg', '一个千门高手，因为一道闪电，莫名其妙的来到了大唐永徽四年。\n    自此，一个个弥天大谎，让整个世界都为他起舞。\n    不管是刚刚即位不久的唐高宗，还是当下权倾一时的长孙无忌，又或者是未来将会成为千古第一女皇的武则天。\n    “真相是痛苦的，现实是残酷的，诚实是伤人的，于是我试着让他们永远都活在我那美丽的谎言下。”\n    －－－－韩艺。\n    －－－－－－－－－－－－－－－－\n    已有完本精品作品《北宋小厨师》，高订破万，七百万字从未断更，贞操未破，节操保留至今，书荒的朋友可以去看看。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('10', '斗罗大陆III龙王传说', '唐家三少', null, '/image/16/16288/16288s.jpg', '伴随着魂导科技的进步，斗罗大陆上的人类征服了海洋，又发现了两片大陆。魂兽也随着人类魂师的猎杀无度走向灭亡，沉睡无数年的魂兽之王在星斗大森林最后的净土苏醒，它要带领仅存的族人，向人类复仇！     唐舞麟立志要成为一名强大的魂师，可当武魂觉醒时，苏醒的，却是……     旷世之才，龙王之争，我们的龙王传说，将由此开始。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('11', '神级大魔头', '拉姆', null, '/image/17/17796/17796s.jpg', '“无耻夏平，抢我秘籍，夺我丹药，泡我未婚妻，我和你不共戴天。”“他是武道之耻，人类蛀虫，是人渣败类。”“无恶不作，连三岁小儿的棒棒糖也抢，老人过马路都不扶。”“四处惹是生非，各大家族的天才都被他殴打过，人神共愤啊。”炎黄星无数武道强者对夏平咬牙切齿，简直恨不得将其挫骨扬灰。而夏平面对这么多人的仇恨，淡定的拉出“超级仇恨系统”界面，看着上面各种好东西，摸了摸下巴：“都积攒到这么多仇恨值了，不知道是兑换圣品丹药混沌丹，还是绝世武学如来掌，或者是神器乾坤鼎，真是烦恼啊。”', null, '2018-09-01 17:41:25', '3', '3', '0'), ('12', '太古神王', '净无痕', null, '/image/4/4661/4661s.jpg', '【玄幻爽文】九天大陆，天穹之上有九条星河，亿万星辰，皆为武命星辰，武道之人，可沟通星辰，觉醒星魂，成武命修士。     传说，九天大陆最为厉害的武修，每突破一个境界，便能开辟一扇星门，从而沟通一颗星辰，直至，让九重天上，都有自己的武命星辰，化身通天彻地的太古神王。     亿万生灵、诸天万界，秦问天笑看苍天，他要做天空，最亮的那颗星辰。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('13', '从仙侠世界归来', '发狂的妖魔', null, '/image/13/13935/13935s.jpg', '五年前，萧凡突然神秘失踪，生不见人，死不见尸，没人知道他其实是去了一个广袤无边，仙神林立，妖魔横行的仙侠世界。\n    五年后，萧凡已经在那个仙侠世界度过了漫长的五千年，带着一身神秘莫测，通天动地的能力，他又重新回来了。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('14', '遮天之万古独尊', '星之煌', null, '/image/17/17506/17506s.jpg', '上击九天，下镇十地，天上地下，唯我独尊！\n    以九天十地为棋局，阴阳颠倒为黑白棋子，乾坤斗转为纵横棋路，杀出一条成道路！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('15', '超级神基因', '十二翼黑暗炽天使', null, '/image/17/17503/17503s.jpg', '未来波澜壮阔的星际时代，人类终于攻克了空间传送技术，可是当人类传送到另一端的时候，却发现那里并不是过去未来，也不是星空下的任何一片土地……\n    神秘的庇护所世界，无数强横的异生物，人类迎来了令人热血沸腾的飞跃性大进化，开启了星空下最辉煌璀璨的新纪元。\n    “猎杀神血生物黑甲虫，获得神血黑甲虫兽魂，食用神血黑甲虫血肉，可随机获得0至10点神基因。”', null, '2018-09-01 17:41:25', '3', '3', '0'), ('16', '雪鹰领主', '我吃西红柿', null, '/image/8/8888/8888s.jpg', '在帝国的安阳行省，有一个很小很不起眼的贵族领地，叫——雪鹰领！     故事，就从这里开始！     继《莽荒纪》《吞噬星空》《九鼎记》《盘龙》《星辰变》《寸芒》《星峰传说》后，番茄的第八本小说！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('17', '真武世界', '蚕茧里的牛', null, '/image/2/2826/2826s.jpg', '有一天，易云去爬山，在山洞中发现了一张神秘的紫色卡片。     他触及卡片的一瞬间，山体塌方。     在他好不容易爬出来之后，却见到了极度不可思议的一幕，呃……具体什么不可思议，请看本书第一章。     ——这是一个瑰丽而又充满未知的真武世界，这是一个平凡少年成就绝世强者的传奇。     作者蚕茧里的牛，已有完本作品《武极天下》，书荒可以看一看。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('18', '纨绔邪皇', '开荒', null, '/image/16/16382/16382s.jpg', '天圣二十七年九月十七，当安国公世子赢冲在咸阳城勾栏巷被天外陨星砸晕的时候，大秦国师守正道人手持玄宙天珠坐化于城外白云观内。    ——这是一个关于纨绔的故事，一个关于万古邪皇的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('19', '牧神记', '宅猪', null, '/image/6/6595/6595s.jpg', '大墟的祖训说，天黑，别出门。大墟残老村的老弱病残们从江边捡到了一个婴儿，取名秦牧，含辛茹苦将他养大。这一天夜幕降临，黑暗笼罩大墟，秦牧走出了家门……做个春风中荡漾的反派吧！瞎子对他说。秦牧的反派之路，正在崛起！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('20', '巫师不朽', '两只陈洁南', null, '/image/18/18634/18634s.jpg', '这是一个二次穿越的穿越者，在巫师世界踏上巫师之路的故事。  在末日世界猎取晶核，在始祖世界提取血脉，在诸神世界猎杀诸神...  身带穿越异能，穿梭无尽世界，掠夺无尽世界的知识与资源，成就自身巫师之道...', null, '2018-09-01 17:41:25', '3', '3', '0'), ('21', '箭魔', '明月夜色', null, '/image/12/12795/12795s.jpg', '这是 一个属于弓箭手的传奇，不朽王座史上唯一的弓箭手意外陨落，降临九州，开启一条前所未有的箭道之路。     世人眼中箭为小技，难成大道？我不信！我的箭可破日月铸通天之路，因为我就是箭魔！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('22', '重生原始时代', ' ', null, '/image/10/10400/10400s.jpg', '有一天，公良忽然觉得自己的生活太过单调、索然无味，就决定换种方式来过。所以，他毅然放下自己现有的一切，浪迹天涯。     一日来到福建海边，偶然遇到龙吸水，却不幸被吸了进去，再醒来已经到了一个莫知名的地方。     于是，一段精彩纷呈的传奇就开始了。     面似憨厚却心狡如狐的大熊猫、喜欢吃毒物的天鸠部女孩、魁伟巨力的龙伯国人、惨遭邪孽杀害的魂力可灵少女和身世悲怜的三胞胎女孩，一一展现出来。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('23', '一念永恒', '耳根', null, '/image/0/213/213s.jpg', '一念成沧海，一念化桑田。一念斩千魔，一念诛万仙。唯我念……永恒', null, '2018-09-01 17:41:25', '3', '3', '0'), ('24', '重生之魔教教主', '封七月', null, '/image/18/18186/18186s.jpg', '意外身亡，楚休发现自己竟然穿越到了游戏世界《大江湖》当中，成为了游戏中还没成长起来的，第三版的最终反派大boss，祸乱江湖的魔教教主！《大江湖》当中融汇无数武侠背景，有东岛之王天子望气，谈笑杀人。有丐帮之主掌出降龙，威震江湖。也有飞刀传人刀碎虚空，成就绝响。重生一世，楚休究竟是重走一遍命中注定的反派之路，还是踏着如山白骨谱写一段魔焰滔天的江湖传说？“杀人诛心，斩草除根。我叫楚休，万事皆休的休。”', null, '2018-09-01 17:41:25', '3', '3', '0'), ('25', '飞剑问道', '我吃西红柿', null, '/image/18/18820/18820s.jpg', '在这个世界，有狐仙、河神、水怪、大妖，也有求长生的修行者。修行者们，开法眼，可看妖魔鬼怪。炼一口飞剑，可千里杀敌。千里眼、顺风耳，更可探查四方。……秦府二公子‘秦云’，便是一位修行者……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('26', '我是至尊', '风凌天下', null, '/image/16/16209/16209s.jpg', '药不成丹只是毒，人不成神终成灰。…………天道有缺，人间不平，红尘世外，魍魉横行；哀尔良善，怒尔不争；规则之外，吾来执行。布武天下，屠尽不平；手中有刀，心中有情；判决生死，刀断英雄；冷眼红尘，无憾今生。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('27', '一剑飞仙', '流浪的蛤蟆', null, '/image/4/4056/4056s.jpg', '千锤百炼烈火雷霆，十年换得一剑光寒。     潜牙伏爪百般忍受，只为今朝一飞冲霄！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('28', '道君', '跃千愁', null, '/image/5/5892/5892s.jpg', '一个地球神级盗墓宗师，闯入修真界的故事……桃花源里，有歌声。山外青山，白骨山。五花马，千金裘，倚天剑，应我多情，啾啾鬼鸣，美人薄嗔。天地无垠，谁家旗鼓，碧落黄泉，万古高楼。为义气争雄！为乱世争霸！你好，仙侠！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('29', '破庙有神仙', '雪满林中', null, '/image/10/10336/10336s.jpg', '阴阳山上将军庙，荒山野岭出神仙。     一个传承了数百年的将军庙，到了如今末法世界，灵气消散，面对世事巨变，却又该如何自处？     祖传八卦镜，号称打开神秘之门的钥匙，却是否能够取得转机？     一切尽在破庙有神仙！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('30', '凡人修仙之仙界篇', '忘语', null, '/image/18/18998/18998s.jpg', '凡人修仙，风云再起时空穿梭，轮回逆转金仙太乙，大罗道祖三千大道，法则至尊《凡人修仙传》仙界篇，一个韩立叱咤仙界的故事，一个凡人小子修仙的不灭传说。特说明下，没有看过前传的书友，并不影响本书的阅读体验，但感兴趣的书友，也可以先去看看《凡人修仙传》，再来看本书哦。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('31', '剑灵同居日记', '国王陛下', null, '/image/11/11276/11276s.jpg', '“天外神剑剑灵，应呼唤而苏醒，我问你，你就是我的坐骑么？”一个无敌的随身剑灵与天才美少女（们）的同居故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('32', '穿越诸天万界', '天帝大人', null, '/image/17/17306/17306s.jpg', '一花一世界，一叶一菩提，水浒，三国，聊斋，白蛇，蜀山，封神，洪荒……穿梭诸天万界，我为世界之主！\n    （已有二百万完本作品《武侠仙侠世界里的道人》，请放心收藏！）', null, '2018-09-01 17:41:25', '3', '3', '0'), ('33', '主神逍遥', '神秘道人', null, '/image/0/185/185s.jpg', '杨启峰作为主角一生禄禄无为，挂了！重生归来，发现自己竟然被穿越者抢夺了机缘。 在这主神天降，灵气复苏神话再临的年代中，重生者干掉穿越者，漫步诸天万界，屹立于世界之巅。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('34', '我是仙凡', '百里玺', null, '/image/19/19019/19019s.jpg', '苏尘，一名身怀青石泪的凡间少年，无意间打开了自己的灵台，发现无边识海内有一座方寸灵山，世外桃源仙灵之地。灵泉可浇灌一亩仙稻，灵脉可开一座辟洞府，诞生几个仙灵儿，灵草仙花十里如仙境。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('35', '极道天魔', '滚开', null, '/image/18/18023/18023s.jpg', '妖魔横行，世人苦难。神兵魔刃，遮耀天下。——————————————————————手机上的一款游戏修改器，意外成了路胜脑海里的异能。也成了他在这个黑暗乱世唯一的依靠。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('36', '青城道长', '虫梦', null, '/image/10/10078/10078s.jpg', '人行大道，号为道士，道士之长，故称道长，降妖、灭魔、除秽、安宅、卜算、治病，皆是其行走人间必做之事，然而在这之前，你得先填饱自己的肚子。     ‘瞧一瞧，看一看，青城派又推行各种新型业务了，算卦：五贯，出诊：三贯，镇宅：十贯，送葬：视死者身份出价，二两起步。’     ‘还有重磅消息，天庭、阴司、西天极乐世界等官方机构进行团购业务，一律八折起价，另有配套的打折卡、纸符大礼包赠送，道家门人享内部价，最低能打六折。’     ‘女侠，考虑到我们上一次的合作很愉快，这一次就给您打个九五折，当然，若是您现在办理', null, '2018-09-01 17:41:25', '3', '3', '0'), ('37', '不朽凡人', '鹅是老五', null, '/image/0/188/188s.jpg', '我，只有凡根，一介凡人！    我，叫莫无忌！    我，要不朽！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('38', '西游之穿越诸天', '干燥的心', null, '/image/18/18199/18199s.jpg', '一觉醒来，成了西游世界里北海龙王的私生子，没有功法没有宝物血脉稀薄……幸好，我还可以穿越诸天万界。葫芦兄弟、倩女幽魂、仙剑奇侠、人生长恨水长东……这是一个在西游世界里穿越诸天，在西游世界里证道长生的故事！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('39', '封仙', '六月观主', null, '/image/9/9701/9701s.jpg', '天地初定，大道无序。     今有众仙共立封神榜，定天地秩序，立九霄天庭，幽冥地府，封诸天神灵。     紫霄门下道童清原，身作福薄命薄无仙根者，然而一心修道，遂而下界。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('40', '永恒国度', '孤独漂流', null, '/image/17/17285/17285s.jpg', '2019年9月23日凌晨，天灾降临。     天道生变，万灵欲念执念充斥天地，天道不能承受，恶念横行，众生意念演变幻想世界，恶念，善念，执念，欲望纠缠不休，天道无法承受，已到极限，极则变，幻想降临，万界相融，万物霜天竞自由。     此为新纪元开启，是毁灭，亦为新生。这一纪元为永恒纪元。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('41', '盗天仙途', '荆柯守', null, '/image/12/12242/12242s.jpg', '福地产生地仙，洞天来往天仙，我有梅花一株，盗取天机！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('42', '最强反派系统', ' ', null, '/image/16/16611/16611s.jpg', '什么是反派？\n    是李沉舟拳倾天下，还是上官金虹搅动风云？\n    是叶孤城天外飞仙，还是元十三限小箭伤心？\n    重生一世，大反派系统加身，苏信可以获得前世武侠世界当中所有的反派人物功法和武技。\n    前世惨遭横死，这一世自己要做，就要做那最狠、最强的大反派！\n    人皆言我恶，那我便凶残到底！\n    人皆言我邪，那我便魔焰滔天！     “做人要讲信用。说杀你全家，就杀你全家。我叫苏信，我言而有信。”                           扣群:486217939', null, '2018-09-01 17:41:25', '3', '3', '0'), ('43', '神书纪元', ' ', null, '/image/16/16888/16888s.jpg', '他穿越而来，却不幸活在一个战乱世代；     他本是皇子，却被迫流浪在外，颠沛流离；     仙道无道，视百姓为刍狗；朝廷不仁，视百姓为鱼肉；世家不义，视百姓为猪狗。     拔起长剑，骑上战马，纵横天下，革除弊世。     天道不平，我平之；天地不公，我公之；人间有弊，我弊之。     以我之手，开辟新的纪元。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('44', '道辟九霄', '太上真君', null, '/image/17/17653/17653s.jpg', '重阳流连，昔年勘破桃花处。大道心开，立得九重天上来。天涯回首，不见旧乡三四友。羽化升遐，与天同寿神仙家。手持神秘龙鳞，开辟九重仙天，光耀诸天世界，少年展开自己的仙侠之旅。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('45', '我真是大明星', '尝谕', null, '/image/3/3907/3907s.jpg', '我做了一个梦，然后世界就变成了一款游戏，世界背景被游戏随机修改了，幡然一新，历史与社会结构虽然变化不大，但却没有了那些我熟知的综艺节目、音乐作品、文学作品和影视作品。游戏还有商城，里面提供了一系列神奇的物品：     【存档】：可保存记录，读取进度。     【魅力果实】：永久性增加玩家魅力值。     【幸运果汁】：五分钟之内增加玩家幸运值。     【八卦掌经验书】：阅读后提升玩家该技能经验值。     凭借这款游戏的帮助，我从一个小小的播音主持人做起一步步变成大明星了！     【尝谕出品】：已完本', null, '2018-09-01 17:41:25', '3', '3', '0'), ('46', '重生完美时代', '公子不歌', null, '/image/16/16396/16396s.jpg', '老牌程序员出身的李牧，被命运一脚踹回了2001年高考的当口，他欣喜的拍拍屁股，起身便踏上了一条注定牛X的道路。\n    重活一回，李牧有他自己的追求，赚钱只是牛X的初级阶段，至于登上时代周刊、制霸IT产业、问鼎福布斯榜，也就勉强算是人生的中级阶段了，至于什么才是牛X的最高境界，李牧觉得有以下三点：\n    做名人的教父；\n    做富人的偶像；\n    做牛人的干爹……\n    ---------\n    不能免俗的建了一个读者群：526459805，欢迎进来吹水扯淡。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('47', '修真聊天群', '圣骑士的传说', null, '/image/10/10459/10459s.jpg', '某天，宋书航意外加入了一个仙侠中二病资深患者的交流群，里面的群友们都以‘道友’相称，群名片都是各种府主、洞主、真人、天师。连群主走失的宠物犬都称为大妖犬离家出走。整天聊的是炼丹、闯秘境、炼功经验啥的。    突然有一天，潜水良久的他突然发现……群里每一个群员，竟然全部是修真者，能移山倒海、长生千年的那种！    啊啊啊啊，世界观在一夜间彻底崩碎啦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('48', '仙界归来', '静夜寄思', null, '/image/3/3074/3074s.jpg', '仙界一代通天巨擘魂飞魄散，一缕魂魄回归到地球上原本的身体之中，唐修惊讶地发现仙界过去了一万年，地球上才过去了一年时间。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('49', '超品巫师', '九灯和善', null, '/image/1/1237/1237s.jpg', '一本关于巫的故事的书，跳脱于佛道两家之外，一个少年偶得巫师传承的故事', null, '2018-09-01 17:41:25', '3', '3', '0'), ('50', '宠物天王', '皆破', null, '/image/18/18167/18167s.jpg', '【1.下载一款可疑的游戏】【2.捕捉几只神奇的宠物当伙伴】【3.在轻松有趣的日常里，带领宠物店走上崛起之路】', null, '2018-09-01 17:41:25', '3', '3', '0'), ('51', '顾道长生', '睡觉会变白', null, '/image/10/10493/10493s.jpg', '大概是一个从现代文明演变成修真文明的故事。主角的作用主要是吐槽，顺便更改世界设定，以及带着一帮人浪天浪地浪飞边儿。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('52', '超级军工霸主', '安溪柚', null, '/image/7/7425/7425s.jpg', '军工是军队强大的基石，军工是国家强盛的保障，军工是民族不败的核心，卢嘉栋，一位总装备部军工技术专家，重生到1977年，来到一个地处西南的三线军工小厂。从此，卢嘉栋带领军工人挥汗如雨，踏上了一条改变命运，赶超世界的军工霸主之路。     40毫米枪挂榴弹发射器、枣核型榴弹、长身管远程榴弹炮、末敏弹药、J—20战斗机、反舰弹道导弹、055导弹驱逐舰、001A航空母舰......各种先进武器装备尽在《超级军工霸主》。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('53', '佣兵的战争', '如水意', null, '/image/3/3817/3817s.jpg', '高扬是一个军迷，一个很普通的军迷，爱刀，爱枪，爱冒险。     一次意外，高扬跑去了非洲，结果不幸遇到了空难，侥幸活命，却从此只能在枪口下混饭吃了，因为他成了一个雇佣兵。     一个军迷，能在国际佣兵界达到什么样的高度？     请拭目以待吧。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('54', '我的邻居是女妖', '傲无常', null, '/image/16/16154/16154s.jpg', '王焱同志：在2015年度“华东地区超能者违纪三项全面整治”、“热火朝天大干一百天再争辉煌”、“孤寡女妖送温暖”、“人妖和平共处知识全面普及”等专项工作中，表现优异，成绩突出。荣获‘先进个人’称号，特发此状，以资鼓励。     －－国非局华东分局     王焱先生：鉴于阁下在打击“跨国超能者邪恶组织”，以及维稳“女妖国际紫荆花联盟”等事件中，发挥了积极重要的作用，维护了世界和平。充分展现了世界范围内，官方超能者联合执法体系的优越性以及必要性。     特授予阁下“世界十大杰出超能者青年”的荣誉称号，特发此状', null, '2018-09-01 17:41:25', '3', '3', '0'), ('55', '大王饶命', '会说话的肘子', null, '/image/18/18727/18727s.jpg', '灵气复苏了，吕树眼瞅着一个个大能横空出世。然后再看一眼自己不太正经的能力，倒吸一口冷气。玩狗蛋啊！……这是一个吕树依靠毒鸡汤成为大魔王的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('56', '超时空垃圾站', '小城古道', null, '/image/16/16180/16180s.jpg', '苏璟大学毕业后，处处碰壁，心灰意冷，回老家调整心情。却发现自家后院，成了超时空垃圾站，每天都有大量垃圾汇入其中，有的来自神墓、斗破苍穹、盘龙等小说时空；有的来自海贼王、火影、死神等动漫时空；有的来自X战警、美国队长、钢铁侠等漫威时空……作为垃圾站主人，苏璟有处理这些垃圾的义务。一开始他认为这是一件苦差，后来才发现，这是这辈子所遇到过的最美的美差。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('57', '我的大小美女花', '明日复明日', null, '/image/17/17189/17189s.jpg', '宋晓冬两年前在拉斯维加斯偶遇一个女孩，两人图好玩还去注册结婚，度过了一个美妙的夜晚。    两年后回家，家里竟然住进了一对双胞胎姐妹，长的完全一模一样，甚至于连声音都是无法分辩。    最主要的是，这其中一个就应该是自己两年前登记结婚的那一个，但这两人谁也不承认当初的事情，就连宋晓冬也是无法判断出来。    这是什么一码子情况，宋晓冬也是一脸懵……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('58', '好莱坞之路', '白色十三号', null, '/image/10/10246/10246s.jpg', '这是一个无比耀眼的圈子，在这里每向上爬一步，都要付出巨大的努力，都要踩下无数竞争者的脑袋。     数不清的天才的怀揣着梦想来到好莱坞，绝大多数都倒在了前进的道路上，最后变成普通人。     向上爬的过程中，天赋的作用常常会超过努力，但机会比天赋和努力更重要！     这是一个小人物，抓住一切机会，走上好莱坞成名道路的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('59', '完美人生', '刀一耕', null, '/image/11/11434/11434s.jpg', '李谦重生了。\n    另外一个时空的1995年。\n    在这里，他当然比普通人更容易获得成功。\n    但成功是什么？\n    钱么？或者，名气？地位？荣耀？\n    都是，但不全是。\n    有了那回眸的浅浅一笑，那牵手的刹那温暖，那入怀的淡淡体香；\n    这人生，才称得上完美。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('60', '最强医圣', '左耳思念', null, '/image/17/17106/17106s.jpg', '带着一身通天本领强势回归。     会治病、会算命、会炼药、会摆阵、会炼符……     “这个世界上没有我办不到的事情！”——沈风', null, '2018-09-01 17:41:25', '3', '3', '0'), ('61', '神级幸运星', '辰机唐红豆', null, '/image/10/10381/10381s.jpg', '无意中获得了一枚运气骰子，还穿越到娱乐业匮乏的平行位面，王昊这下牛逼了。     运气骰子的六个面分别是“非常倒霉，倒霉，普通，好运，非常好运，神级好运”，每天零点刷新！     “不知道今天会是什么运气，求给力啊！”零点钟声响过，王昊闭着眼睛，把骰子往桌子上一扔！     “哗啦啦……”骰子一阵乱转，等停下后，王昊顿时倒吸一口冷气！     “卧槽！”     只见运气骰子最上面赫然写着……     ————————     豪盟总群：9996639，弟子以上粉丝可加。     已有完本均订破万作品《重', null, '2018-09-01 17:41:25', '3', '3', '0'), ('62', '美国之大牧场主', '陶良辰', null, ' ', '重生八十年代美国华人富豪家族，天生就有亲和动植物的能力。\n    科迪亚克棕熊悠然坐在屋檐下，龙猫被异国短尾猫追着跑。\n    雪山映在湛蓝天空中，微风吹过草原，罗塔湖面荡起波澜，一望无际的薰衣草田随风摇摆。\n    白桦林里，澳洲迷你驴探出脑袋，男孩躺葡萄架下，睡的好香。\n    带你玩转世界商圈，看遍全球美景。\n    我是美国大地主韩宣。\n    ps：书友群498076359', null, '2018-09-01 17:41:25', '3', '3', '0'), ('63', '黄金渔村', '全金属弹壳', null, '/image/0/701/701s.jpg', '在大城市打工多年的敖沐阳回到养育他的家乡小渔村，归途中遇袭落海，揭开了一段草鱼跳龙门的传奇……  深洋千珍、浅海万鱼，神奇的海洋，绚丽的生命；  渔家捕捞、山涧耕种，悠然的田园，简单的乡野；  萌宠机灵、天水共色，多彩的自然，壮美的河山。  精彩人生，就此徐徐拉开帷幕！  《黄金渔场》姊妹篇，全新演绎一段经历更有趣、内容更丰富、见识更多广的海洋种田生活！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('64', '神藏', '打眼', null, '/image/16/16271/16271s.jpg', '一念之间，沧海桑田     打眼带你进入古玩的世界！！！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('65', '文娱缔造者', '别人家的小猫咪', null, '/image/10/10264/10264s.jpg', '要么孤独，要么庸俗。        ps：我是来矫正文娱写法的，以上。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('66', '我家农场有条龙', ' ', null, '/image/6/6325/6325s.jpg', '雷欢喜养了一条龙，恩，货真价实的一条龙，地球上最后的一条龙。于是雷欢喜的生活就被彻底改变了。\n    他能种出比蟠桃还要甜美的桃子，能在自家的水塘里养出真正的频临绝种的野生大黄鱼。\n    你要千年人参？等一晚上就有，真正的千年人参。你要海马等着急用？等着，欢喜哥这就到游泳池里给你养去，一小时就好。\n    欢喜哥的幸福生活开始了。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('67', '银狐', '孑与2', null, '/image/12/12001/12001s.jpg', '人的第一要求就是活着，第二要求还是活着，第三要求依旧是活着……在某些特定的环境下，活着就成了一种奢望。     在地狱中我们仰望天堂，把手伸出去，虽然不能触碰到天堂，却能让我们距离天堂更近一些。     在地狱里歌唱，在地狱里感恩，在地狱里相爱，在地狱里相杀，我们流着眼泪相互簇拥而后将匕首刺进对方的胸腹，不为别的，只是为了哪一丝丝若有若无的感恩。     大宋的世界是我的羁绊，也是我的天空，只有振翅飞翔的鸟儿才晓得天空的含义。     皇帝说——借我皇家广厦一角，与你母子安身。     铁心源说——滴水之', null, '2018-09-01 17:41:25', '3', '3', '0'), ('68', '寒门状元', '天子', null, '/image/16/16289/16289s.jpg', '看腻了刀光剑影，鼓角争鸣，或者可以品尝一下社会底层草根的艰苦营生。     本书讲述的是穿越大明落魄寒门的沈溪，在这个万般皆下品惟有读书高的年代，用他的努力一步步改变命运，终于走上人生巅峰！     天子2016历史巨献，值得您拥有！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('69', '懒散初唐', '北冥老鱼', null, '/image/10/10370/10370s.jpg', '武德五年，大唐初立，李渊呆在美女如云的后宫之中，忙着享受自己得来不易的胜利果实，李建成忙着稳固自己的太子之位，李世民忙着觊觎大哥的位子，武将们忙着打仗，文臣们忙着治国，商人们忙着与胡商做生意，农户们忙着开垦荒地……    在这片繁忙之中，李休抱着墓碑在长安城外醒来，看着眼前的初唐气象，他却是叹了口气，既然别人都这么忙，那他就不打搅了，还是安心的过自己的小日子好了，想吃就吃，想睡就睡，懒懒散散的也挺好。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('70', '寒门枭士', '高月', null, '/image/18/18049/18049s.jpg', '当金兵的铁蹄即将踏碎黄河坚冰，他走进了这个繁华如清明上河图的时代', null, '2018-09-01 17:41:25', '3', '3', '0'), ('71', '奋斗在红楼', '九悟', null, '/image/16/16698/16698s.jpg', '大周朝，雍治7年冬，美丽、傲娇的小萝-莉林黛玉刚刚进入贾府。     现代理科男穿越红楼贾府庶子贾环。如果不想被贾府的猪队友们连累的抄家杀头，就要早做准备。     这是一个庶子逆袭的故事。     Ps：本书是架空历史爽文。非考据党、非历史正剧党、非红学党，遗漏不符、错误矛盾之处，敬请谅解。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('72', '庶子风流', '上山打老虎额', null, '/image/10/10303/10303s.jpg', '聘为妻，奔为妾。出生似乎有些尴尬，族人的冷落，不厚道的亲戚，浑浑噩噩的天子。    回归大明，不再做书呆子！    书生意气，本就是另类的潇洒自在。    封狼居胥，理应是唯我独尊的阔达。    衙内的克星，深闺的密友，朝廷的肱骨，正德一朝，太多荆棘，待金戈在手，容我一一斩除！    秦淮河畔多知己，塞外辽原有音笛。    自古风流出少年，且看庶子叶春秋。    叶春秋享受这个时代的美好，却用他与众不同的“脑袋”改变了整个世界的节奏！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('73', '孺子帝', '冰临神下', null, '/image/10/10105/10105s.jpg', '三位皇帝接连驾崩，从来没人注意过的皇子莫名其妙地继位，身陷重重危险之中。太后不喜欢他，时刻想要再立一名更年幼、更听话的新皇帝；同父异母的兄弟不喜欢他，认为他夺走了本属于自己的皇位；太监与宫女们也不喜欢他，觉得他不像真正的皇帝……孺子帝唯有自救。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('74', '大魏宫廷', '贱宗首席弟子', null, '/image/16/16263/16263s.jpg', '生作大魏皇子，     愿当盛世闲王。     志在偎红倚翠犬马声色，     胸怀家国百姓社稷安危。     若兄贤，若弟明，     尔为人王吾偷闲。     若尔不能使国强，     吾来登基做帝王！     ————弘润《你不行我上》', null, '2018-09-01 17:41:25', '3', '3', '0'), ('75', '汉乡', '孑与2', null, '/image/18/18698/18698s.jpg', '我们接受了祖先的遗产，这让中华辉煌了数千年，我们是如此的心安理得，从未想过要回归那个在刀耕火种中苦苦寻找出路的时代。反哺我们苦难的祖先，并从中找到故乡的真正意义，将是本书要讲的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('76', '大文豪', '上山打老虎额', null, '/image/13/13491/13491s.jpg', '久经商战中勾心斗角，推杯把盏中尔虞尔诈的文学青年陈凯之回到了古代。放眼看去，这里尽是歌楼酒坊，灯红酒绿，才子佳人，春宵一刻千金散。好吧，暂时这些和陈凯之没关系。寒门少年一枚，身份尴尬。且看这寒门少年如何一路逆袭，成就大文豪的精彩之路。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('77', '寒门崛起', '朱郎才尽', null, '/image/8/8584/8584s.jpg', '这是一个就业路上屡被蹂躏的古汉语专业研究生，回到了明朝中叶，进入了山村一家幼童身体后的故事。\n    木讷父亲泼辣娘，一水的极品亲戚，农家小院是非不少。好在，咱有几千年的历史积淀，四书五经八股文，专业也对口，谁言寒门再难出贵子。\n    国力上升垂拱而治；\n    法纪松弛，官纪慵散；\n    有几只奸臣，也闹点倭寇；\n    但总体上可以说，这是士大夫自由滋生的沃土。\n    一个寒门崛起的传奇也就从这里生长了。\n    谨以此文向所有的穿越经典致敬。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('78', '交锋', '可大可小', null, '/image/17/17424/17424s.jpg', '在一般人眼中，他是平庸、无能、贪婪，甚至有些愚蠢的警察。因为他，经常行动失败，多次无意泄露了重要情报。但他交游广泛，善于溜须拍马和钻营，是军政不倒翁。在日伪眼中，他忠诚、可靠。而在军统的眼中，他是人才，也是功臣。其实，他一直受我党领导，是一名坚定的革命战士，一名杰出的地下情报工作者！在地下工作中，力挽狂澜，立下了不朽的功勋！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('79', '秦吏', '七月新番', null, '/image/19/19208/19208s.jpg', '战国之世，华夏千年未有之大变局。有人天生世卿之家。有人贵为公子王孙。黑夫却重生成区区秦国士伍，云梦秦简中的小人物。为了不死于沟壑，为掌握自己命运，他奋力向上攀爬。好在，他赶上了一个好时代。六王毕，四海一!千年血统，敌不过军功授爵，世族豪贵，皆被秦吏踩在脚下。黑夫只想笑问一句:王侯将相，宁有种乎?逐匈奴，征百越，废封建，焚诗书，在他参与下，历史是否发生改变?始皇帝死而地分，身为秦吏，他又该如何抉择，是推波助澜，还是力挽狂澜?', null, '2018-09-01 17:41:25', '3', '3', '0'), ('80', '主宰江山', '汉风雄烈', null, '/image/12/12780/12780s.jpg', '十全老人？乾隆大帝？那算个鸟！    老子是要当球长的男人，地球的球长', null, '2018-09-01 17:41:25', '3', '3', '0'), ('81', '第三帝国', '华东之雄', null, '/image/11/11320/11320s.jpg', '血之勋章，荣誉和忠诚的勋章，带着王卫国来到了啤酒馆，参与了这场搅动整个德国的暴动！无敌的战争召唤系统，也随之而来！帝国的坦克不实用？那就召唤T-34的图纸出来！还不行？T-44够不够？T-54爽不爽？脱壳穿甲弹，复合装甲，统统装上帝国的战车！帝国的军队有些少？好吧，看我召唤出强大的兵人军团来！报告，墨索里尼挂掉了！嗯，这件事有些难办，看来，只能召唤个傀儡出来了！这是一本尊重历史的二战文，也是一本带着系统的爽文！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('82', '贞观大闲人', '贼眉鼠眼', null, '/image/5/5917/5917s.jpg', '大唐贞观，天下靖平，山河壮丽，独钟李氏。     李靖北击突厥，太宗东征高丽，兵锋之盛，威服四海。待从头，重整旧山河。功臣画像前，李渊拨弹琵琶独怅然，凌烟楼阁上，李世民大醉翩翩舞春风。     中国历史上最壮丽，最磅礴，最意气风发的年代里，长安古都外，一位粗衣陋衫的少年郎看着落日余晖里的皇城，露出了笑容……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('83', '钢铁皇朝', '背着家的蜗牛', null, '/image/10/10444/10444s.jpg', '一个工科狗带着科技晶石回到了古代，身为皇子他不想争霸，不想腹黑，只想守着他的一亩三分地种种田，搞搞工业，混吃等死。    PS：这是一部轻松的种田文。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('84', '隋末之乱臣贼子', '堕落的狼崽', null, '/image/7/7407/7407s.jpg', '横空出世的英雄，光荣而辉煌的帝国。     这是一个英雄辈出的时代，甚至无边无际的英雄气概一直蔓延到遥远的未来。生活在天朝下的李信来到了这个光辉岁月的时代，金戈铁马的岁月之中，杨广、李世民、窦建德等等英雄在纷纷倒在他的手中。杜如晦、李靖、房玄龄、长孙无忌等名臣武将纷纷被收入囊中。     他是乱臣，身为隋臣，却是在挖着隋朝的墙角，他是贼子，身为李渊之婿，却抢夺了李渊的江山社稷。     李信之雄，际天所覆，悉臣而属之；薄海内外，无不州县。     凌烟阁：438539802     造化天道：719198', null, '2018-09-01 17:41:25', '3', '3', '0'), ('85', '帝国吃相', '牧尘客', null, '/image/13/13324/13324s.jpg', '陈旭一场车祸穿越到秦朝，而此时秦始皇刚刚统一六国失去了人生的奋斗目标。在考虑抱项羽大腿还是抱刘邦的大腿之中纠结迷茫很久之后，他给秦始皇敬献了一个地球仪。“丞相，此岛是何地？有何物产？可有长生不老之药？”“回陛下，此处叫做东胜神州，有上古殷商遗民，自称印第安人，此处并无长生之药，但在最南边的太古蛮荒地界，有一神奇之物叫做玛卡，久食可以强肾壮阳延年益寿！”“哈哈，好，命令项羽将军速速造船东渡海峡，给朕取来玛卡！”“陛下，东胜神州还盛产一种南美大虾，味道甚美！”“既然丞相爱吃，朕命令项将军为你取来就是！”“多谢', null, '2018-09-01 17:41:25', '3', '3', '0'), ('86', '晚清之乱臣贼子', '吴老狼', null, '/image/10/10403/10403s.jpg', '穿越到了大买办吴健彰的宝贝孙子身上，家财万贯又有钱有势，胸无大志的吴超越原来只想当个富家翁足矣，但就是因为交了几个洋人损友，吴超越的计划就变了。     被洋人喜欢和利用，被朝廷嫉恨，被百姓误解，太平军和小刀会的威胁又已经迫在眉睫。不得已，吴超越只能是走上了一条推翻大清的不归路。     慈禧好侄女，曾剃头好老师，杨秀清好兄弟，不是我要坑你们，是你们逼我的啊！——吴超越痛心疾首的哭喊。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('87', '天唐锦绣', '公子許', null, '/image/17/17634/17634s.jpg', '穿越是一件很有意思的事儿，但是当房俊穿越到那位浑身冒着绿油油光芒的唐朝同名前辈身上，就感觉生活全都不好了……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('88', '督军', ' ', null, '/image/10/10140/10140s.jpg', '民犹是也，国犹是也，无分南北    总而言之，统而言之，不是东西    这是个最好的时代，一些人用热血和生命实现梦想，为国家寻找出路。    这是个最坏的时代，许多人看不到希望在哪，在他们面前，除了黑暗，还是黑暗。    在这样的大时代中，一个出身市井的小人物，乘风破浪，一路高歌。    城头变幻大王旗，     河边枯骨谁人惜。     错命乱曲狂笑去，     轩辕墓前温酒棋。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('89', '主神崛起', '文抄公', null, '/image/17/17275/17275s.jpg', '一觉醒来穿越成反派？这剧本不对！     还抢了人家的妹子？又有一个强势的姐姐？剧本更不对了！     居然还有主神空间，诸天万界？我一定是在做梦！吴明淡定地木着脸，继续着征程。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('90', '武林半侠传', '文抄公', null, '/image/9/9726/9726s.jpg', '主角的高武与传奇位面之旅。        主角穿越高武世界，诸位面旅行的故事。    力争还原最基本的武侠故事，畅游儿时的梦想。    已完本《香火成神道》、《巫界术士》，品质更新，完本保证！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('91', '重生之最强剑神', '天运老猫', null, '/image/7/7819/7819s.jpg', ';重头再来，为了掌控命运，再次进入了这款“活着的游戏”。这一次，他不会在受人所制。身为200级剑王，这一世他要攀向更高峰。游戏赚钱技巧！游戏副本攻略！游戏传奇任务！游戏装备出处！玩家所不知的战斗技巧！就连封测者都不知道秘密，统统都知道。百国大战，生命进阶，踏入神位，剑凌巅峰，开始一段至高剑神的传奇。PS：如果喜欢，请点击收藏一下。\n    各位书友要是觉得《重生之最强剑神》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('92', '逍遥梦路', '文抄公', null, '/image/18/18550/18550s.jpg', '深山宅男，一路种种田，养养鱼，做做梦，顺带悠闲成长的故事。咦？最后一不小心征服诸天万界，成为了大BOSS？莫非我还没睡醒？', null, '2018-09-01 17:41:25', '3', '3', '0'), ('93', '体坛之篮球教父', '肉末大茄子', null, '/image/17/17354/17354s.jpg', '穿越2006，喜获神级教练系统。帮助姚麦夺冠，圆无数中国球迷的心中的冠军梦。当雷霆四少留守俄城，一个崭新的NBA王朝就此缔造。一支平民球队，又如何把不可一世的勇士王朝掀翻下马。一次穿越，一段关于NBA王朝教父的传说。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('94', '球场教父', '猪头七', null, '/image/10/10342/10342s.jpg', '这是一个关于追求胜利的故事。    “你们只需要牢记一点，在这里，我才是最重要的人！”李昂霸气十足，主教练的权威不容挑战，这是所有的人都必须认识到的。    有的人讨厌他，有的人疯狂崇拜他。    我是李昂，这是我的故事，一个关于梦想和征服的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('95', '英雄监狱', '黄华溢', null, '/image/0/834/834s.jpg', '有些人注定要相聚，哪怕一个在天堂，一个在地狱。\n    玫瑰监狱，现实世界第一监狱！\n    这里关押着全球最顶尖的罪犯，商界精英、政界巨头、超级黑客、甚至是核武器专家都能在这里找到，带领这样一群人进入虚拟世界，会发生什么事情？\n    英雄监狱，虚拟世界第一监狱！\n    这里关着最传奇的英雄和魔兽，末日使者、远古妖皇、巨魔酋长、赏金猎人、甚至是强大的——神！随身带着这样一座监狱，谁惹了我，我就放一头出来……\n    其实世界就是一座监狱，想要获得真正的自由，就要改变世界！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('96', '恶魔囚笼', '颓废龙', null, '/image/12/12172/12172s.jpg', '一款不受任何保护的地下游戏，一群追逐权利、财富、生命的玩家！ 命不久矣的秦然，选择进入其中——为了活下去的机会！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('97', '全职高手', '蝴蝶蓝', null, '/image/0/32/32s.jpg', '勾心斗角之后，谁夺走了我的荣耀？（第一章）\n    风雨飘摇之下，希望却不曾破灭。（开新区了）\n    花团锦簇之中，没有迷失了方向。（哥是高手）\n    万众瞩目之前，我，就在这里回归了！（微微一笑）\n    人情冷暖。（请字幕君交错红色大字放出）\n    谜。（最大号）\n    荣耀。（本书游戏的名字）\n    王者归来。（本书主线）主角：蝴蝶蓝\n    各位书友要是觉得《全职高手》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('98', '网游之我是武学家', '铁牛仙', null, '/image/16/16617/16617s.jpg', '为了爱人，逃出家门，自幼娇生惯养的他步入社会才知道什么叫做百无一用。\n    他什么都不会，除了功夫！\n    格斗家这个职业在游戏里和他一样，引人诟病，被称为垃圾职业。     之所以垃圾，是因为没人知道这个职业的精髓。     当一个真正的武学家拾起这个废柴职业的时候，它的荣光将照耀整个大陆！\n    QQ群385142538  欢迎大家加入', null, '2018-09-01 17:41:25', '3', '3', '0'), ('99', '港岛大亨', '红林小盗', null, ' ', '1979年，一个倒退了四十年的时空。\n    故事从一行人偷渡越港开始，叶景诚凭着个人毅力，成功攀过边境的铁丝网。此间，港岛最赚钱行业有三：股票、地产、电影。\n    叶景诚决定先玩玩股票，赚到一笔起始资金再转行电影界。凭着一个港片爱好者的身份，别的不说，再不济也得潜两个女明星……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('100', '重生之暗夜崛起', '家里第三胖', null, '/image/18/18380/18380s.jpg', '2206的夏天，阿尔法集团号称做出了全智能全息神经联动网络游戏震惊世界，但重生的郭浪却知道，这是一个惊天的骗局！！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('101', '英雄联盟：上帝之手', '三千勿忘尽', null, '/image/17/17265/17265s.jpg', '作为国内最强战队的队长，电竞豪门的绝对王牌，他将自己最好的青春全部奉献给了战队，然而，当英雄迟暮，等待他的，却是被无情的扫地出门！\n    这一世，当忠诚化为可笑的悲哀，梦想沦为现实的囚徒，白桦只想悠然的生活，顺便建立自己的直播帝国。\n    但是，当责任再次降临，纵然他早已决定不再身披战袍，却又如何能够避得了？\n    多年以后，美国《百年电竞》这样写道：他仿佛帝王一般横空出世，带领着当时孱弱的中国战队以神兵之姿横扫全世界！\n    在商业上，他更是一手建立起了庞大的电竞帝国，打造出数不胜数的电竞明星，', null, '2018-09-01 17:41:25', '3', '3', '0'), ('102', '无尽破碎', '隐仙者', null, '/image/4/4483/4483s.jpg', '剑铸吾身。\n    血火为锷，白骨为锋。\n    手创千刃，身临百战，跨越无数战场而不败，亦未曾逢得知己。\n    其姿常立于巅峰之上，独醉于胜利之中；\n    故此生无需任何意义；\n    则其身，定为无尽破碎。\n    书友......\n    各位书友要是觉得《无尽破碎》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('103', '超神机械师', '齐佩甲', null, '/image/18/18457/18457s.jpg', '韩萧，《星海》骨灰级代练，被来自东（zuo）方(zhe)的神秘力量扔进穿越大军，携带玩家面板变成NPC，回到《星海》公测之前，毅然选择难度最高的机械系。战舰列队纵横星海，星辰机甲夭矫如龙，幽能炮毁天灭地，还有无边无际的机械大军，静静待在随身仓库里。一人，即是军团！如果不是玩家出现，本书就是正经严肃的穿越异界题材……作为NPC，正常NPC对玩家功能一应俱全……发布任务？好感度调节？传授技能？为什么会有选择成为玩家跟随者选项啊，把这项给我抠掉！哦，可以解除的啊。电竞第一美女？只想学技能？告辞，洒家卖身不卖艺！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('104', '武侠重生', '大帅匪', null, '/image/8/8514/8514s.jpg', '神级玩家林逸穿越到《大江湖》游戏中。    这里有无数耳熟能详的门派－－－－少林、武当、峨眉、全真、华山、嵩山、衡山、恒山、泰山、桃花岛、明教、日月神教、青城......    还有许多传说中的绝世神功－－－－九阳真经、九阴真经、斗转星移、六脉神剑、凌波微步、太极神功、降龙十八掌、易筋经、北冥神功、八荒六合唯我独尊功、独孤九剑、葵花宝典......    此时正值朝廷微弱，江湖乱战的时代。    为了守护自己珍视的东西——    林逸踏入了江湖！    这是一个少年在乱战江湖中逐渐成长，最终纵横江湖，成为', null, '2018-09-01 17:41:25', '3', '3', '0'), ('105', '惊悚乐园', '三天两觉', null, '/image/0/552/552s.jpg', '这是超越维度的游戏。     亦是追寻真理的竞逐。     未知的封印，鬼神的赌局……     数据的抗争，人类的救赎……     在那个连接着现实的虚拟世界——意识决定我们，意识选择我们，意识决定了我们的意识。     现在，丢掉你的恐惧。     丢掉你的私心杂念、疑问和拒信……解放你的思想。     欢迎来到，惊悚乐园。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('106', '穿越从山贼开始', '怒笑', null, '/image/17/17498/17498s.jpg', '当陆海空知道自己穿越到了一个游戏世界的时候他是懵掰的。\n    当然自己所在的这一个国家居然是东汉，而且还是末年的时候，他觉得自己是可以牛掰的。\n    但当他知道官兵马上就要剿了他们这一个山寨的时候，这家伙就煞笔了。\n    ………………\n    本书书友群：573433978', null, '2018-09-01 17:41:25', '3', '3', '0'), ('107', '网游之近战法师', '蝴蝶蓝', null, '/image/1/1882/1882s.jpg', '一个超级武者,在玩网游时误选了法师,习惯以暴制暴,以力降力的他,只能将错就错,摇身一变,成为一个近战暴力法师,当力量与法术完美结合时,一条新的游戏之路,被他打开了!\n    火球术？闪电链？寒霜冰镜……等等，我是来练功夫的，法术关我什么事？我是法师？哦，对，我是法师。不过……你真的坚信我是法师？好吧，看刀！看剑！看拳！看暗器！什么？你又说我不是法师？如果你不相信，我证明给你看；如果你相信，我表演给你看:法师会功夫，谁也挡不住！\n    各位书友要是觉得《网游之近战法师》还不错的话请不要忘记向您QQ群和微博', null, '2018-09-01 17:41:25', '3', '3', '0'), ('108', '英雄联盟之暴打全球', '喵凯', null, '/image/17/17155/17155s.jpg', '那一年，Faker还没有成为大魔王。     那一年，三星双雄尚未问世。     那一年，LPL还没有沦为韩国殖民地，整个国内电竞圈尚且还是清一色的全华班阵容。     ………     重生S3，败魔王，斩三星。     零封SKT，统治全球！     作为一名英雄联盟职业选手，林穆的目标不是终结韩国队在的统治，更不相信所谓的师夷长技以制夷，指望韩国人去打韩国人。     他要做的，是将这些韩国队扼杀于摇篮之中，彻底剥夺其称霸全球的机会。\n    一个属于中国队的S系列神话，从S3赛季开始。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('109', '全能游戏设计师', '青衫取醉', null, '/image/18/18807/18807s.jpg', '游戏设计师陈陌穿越到点歪了科技树的平行世界，用一款又一款神级游戏颠覆游戏圈的故事。“就以这个时代的游戏设计理念而言，不把整个游戏行业吊起来打那我真是枉受国产免费游戏洗礼了。”——陈陌。书友群：558067640', null, '2018-09-01 17:41:25', '3', '3', '0'), ('110', '重生之我是BOSS', '不是浮云', null, '/image/10/10805/10805s.jpg', '来吧！    杀了我，你就能拥有无尽金币、神器和荣誉！    前提是你能过了我宠物那一关！    没错！    就是门口那个看起来人畜无害的小萝莉！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('111', '武侠世界大穿越', '我叫排云掌', null, '/image/15/15550/15550s.jpg', '一位武学天赋极高的现代散打高手，穿越于各类武侠世界中，一步步成为颠峰强者的故事！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('112', '异常生物见闻录', '远瞳', null, '/image/4/4029/4029s.jpg', '郝仁，人如其名，是个好人，理想是平平安安过一辈子，当个穷不死但也发不了财的小房东——起码在他家里住进去一堆神经病生物之前是这样。\n    一栋偏僻陈旧的大屋，一堆不怎么正常的人外生物，还有一份来自“神明”的劳动合同，三要素加起来让郝仁成为这个世界上最忙碌的房东和最高能的保姆，最混乱、最奇怪、最不正常的房客房东的故事就此开始。\n    “自打在劳动合同上摁手印那天起，我就知道自己是上贼船了……”', null, '2018-09-01 17:41:25', '3', '3', '0'), ('113', '恐怖都市', '猛虎道长', null, '/image/13/13122/13122s.jpg', '本书书裙改为49505078     这这这，出什么事了？     一夜过去，出租房就变得如此破旧？     地板，桌子上布满了灰尘，自己几天前刚贴在墙上的张靓颖海报变得陈旧泛黄，边角破烂，张靓颖那娇媚的颜容也因为纸质变得有些怪异，犹如一个老妖怪朝着自己发出恐怖笑声。     墙壁上布满了破烂的蛛网，犹如雾气缭绕。     放在小茶几上的广柑、苹果已经腐烂干枯，其上生长覆盖的霉都完全发黑，下面的水果就好似一滩干彻的烂泥，就连房东老板才换不久的铝合金窗户都生出了一层白色的毛卤，玻璃灰蒙，出现了几丝裂纹。  ', null, '2018-09-01 17:41:25', '3', '3', '0'), ('114', '无限仙武世界', '宁悦岳', null, '/image/16/16685/16685s.jpg', '白凡：宅男，重生万年之后的末世，绝望中进入仙武轮回空间。\n    穿梭于武侠与仙侠世界，获得各种顶级修炼功法，踏上修炼之路，创立无上仙宗，带领人族终结末世，仙临天下。\n    当是时，一道‘仙界开拓令’揭开了万古前的血秘，曾经流干仙血之地，迎来了又一纪元的征伐……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('115', '神纹战记', '雨水', null, '/image/9/9867/9867s.jpg', '卑微的我，却必然执撑这个世界；踏破虚空，只为了寻找那浩瀚星辰背后的秘密，打开这一扇对人类封尘着的光门。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('116', '光脑武尊', '晚间八点档', null, '/image/2/2178/2178s.jpg', '楚南原本只是一个平平无奇的普通学生，却因为一次意外，获得了等同于最先进光脑的数据收集分析处理能力。    在他的眼里，世界的一切都可以用最为精确的数据给出判定，敌人的任何一次攻击，都只是无数个数据的组合。    甚至……连内息在经脉里的流动，都可以用数据来精确量化。    在这样无比精确的数据帮助下，他不仅可以异常精确地使用自己的肉体力量，更可以改造出最适合自己的内功修炼方式，实力自然是突飞猛进。    在发生这样的突然变化之后，他的人生也随之产生了改变……    ——————    已完成作品《魔法工业', null, '2018-09-01 17:41:25', '3', '3', '0'), ('117', '君临诸天', '隔壁老王01', null, '/image/16/16601/16601s.jpg', '这是一个修真者，为求长生久视，不断穿梭武侠、玄幻、修真等等位面的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('118', '修真四万年', '卧牛真人', null, '/image/6/6217/6217s.jpg', '“这是一艘‘天狼’级晶石战舰，重三亿九千万吨，由一千五百二十三名炼气期修真者操纵，主控晶脑每秒运算九千万道神念，‘计算力’堪比元婴老怪，可以瞬息镇压一个星球！”\n    李耀卓立于无尽星海之上，看着眼前的庞然大物，心中默默计算：\n    “把这艘战舰拆成废铁，我需要——7秒钟！”\n    ……\n    修真40000年代，一个普普通通的边境少年，咆哮星辰，主宰银河的热血传奇！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('119', '幻想世界大穿越', '辰一十一', null, '/image/13/13896/13896s.jpg', '当幻想成为现实，天朝少年能否踏上成神之路？     拥有穿越异能的陈昂，穿越在幻想世界里。     在《永无止境》的世界里，获得超人的智慧，     在《超体》的世界里，窥视成神的奥秘，     从《笑傲江湖》开始，修行内功，进化自己，     由《狂蟒之灾》中，拿到长生的钥匙，     超人血清，绝境药剂，X因子，蜘蛛基因，蜥蜴药剂     嗑药成神的道路漫长而崎岖，     窥视上帝的禁区危险而艰难，     我一路不悔！     （请注意，科幻世界只是点缀，主角的主场，是武侠和魔幻世界！科幻世界一般', null, '2018-09-01 17:41:25', '3', '3', '0'), ('120', '纣临', '三天两觉', null, '/image/17/17380/17380s.jpg', '死而以行为谥。残义损善者，谓之纣。然，此恶谥之祖，实是文治武功，一代枭雄。比之无数上谥之庸才，又当如何？若纣为罪，罪当再临。当这第五王国再次腐朽之时，逆十字的旗帜自当再现。那旗下之恶才、罪徒……亦将再次掀起一场颠覆时代的狂潮。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('121', '武侠世界轮回者', '墨羽云山', null, '/image/19/19254/19254s.jpg', '一个平凡少年，行走在武侠世界，最终成为超凡强者的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('122', '文化入侵异世界', '姐姐的新娘', null, '/image/15/15994/15994s.jpg', '一群巨龙搬着小板凳日夜追看《权利游戏》。精灵大德鲁伊们因为《忠犬八公的故事》而潸然泪下。人类与矮人在《炉石传说》酒馆中为一张传说卡牌而大大出手。甚至就连神明也亲自来到凡间催更小说《福尔摩斯探案集》的连载。最终大德鲁伊们做起了‘滴滴打德’的生意，地精与侏儒全线加盟互联网商店的建设。在异世界掀起一场来自地球的文化入侵！PS：这次不走靠武力的征服胜利了，这次走文化胜利，简而言之就是以折腾互联网和游戏为主，拍电影画漫画为辅的故事。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('123', '末日土行者', '宝巨要崛起', null, '/image/10/10319/10319s.jpg', '残酷的末世到来，丧尸横行，幸存者为了物资而互相杀戮。整个世界变得危险万分。    而他，却拥有封神榜中土行孙的能力。控制泥土，随意在泥土中穿梭。    于是，末世猥琐流诞生了。    凭借着逆天的跑路能力，且看他如何在末世中挣扎求生，建造出一个末世之中最安全的地底王国，成为主宰。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('124', '学霸的黑科技系统', '晨星LL', null, '/image/19/19420/19420s.jpg', '“系统，积分能兑钱吗？”“不能。”“干，那我要你何用！”“本系统能让你当上学霸，全人类的爸爸那种，你还要钱有什么用？”', null, '2018-09-01 17:41:25', '3', '3', '0'), ('125', '狮子兽的征途', '兰陵王小生', null, '/image/11/11716/11716s.jpg', '穿越成数码暴龙中的狮子兽，永远苦逼的正义角色，永远的万年成熟期！    没错！就是那个不管是在哪一部，都没有活过三集，永远活不到大结局的狮子兽，只能活在人们的回忆中的狮子兽，但是，我一定会改变狮子兽的悲剧结局！    我是狮皇凯撒，我为数码宝贝代言。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('126', '黑暗大纪元', '妖仙公子', null, '/image/12/12922/12922s.jpg', '末日降临，拉开了一场地球人类黑暗血腥的进化纪元，对于别人来说末日很可怕，可对于刚刚从末日十五年重生回来的秦天戈来说，绝对是个天大的喜讯。这一世，秦天戈发誓要做那星空百族最强者！前世的人类强者？先收了当小弟！前世的一个个机遇？我先承包了！前世一个个恐怖的人类禁区，人类踏入必死？开玩笑，这一世看我怎么带领手下小弟踏平那些禁区，改造成人类的后花园！星空百族入侵地球，狩猎人族？今世来一个我杀一个，来一双杀一双，杀到百族胆寒，杀到百族不敢越雷池半步！终有一日，我人族必将踏平百族祖地，狩猎星空万族！我们的口号是：人族', null, '2018-09-01 17:41:25', '3', '3', '0'), ('127', '史上最强店主', '南极烈日', null, '/image/16/16962/16962s.jpg', '商通万界，让所有人给我打工。\n    周阳意外获得万界商铺系统，交易万千位面。\n    “我曾举行一次小型拍卖会，来到的皇帝就有一百多位，听说还有两个叫李世民的皇帝。”\n    “我曾让神雕侠侣世界的所有人，帮我养殖菩斯曲蛇，发动海贼世界的所有人，出海帮我寻找恶魔果实。\n    ”我曾招聘员工，貂蝉，西施只能做实习员工，嫦娥，妲己勉强合格。“\n    ······\n    这是周阳获得万界商铺系统，成为史上最强店主的故事。\n    书友群！书友群！书友群在这里！！！！！：\n    476927380', null, '2018-09-01 17:41:25', '3', '3', '0'), ('128', '我的末世基地车', '树袋熊之怒', null, '/image/17/17633/17633s.jpg', '末世即将到来，江流石意外得到了一个可以让交通工具改装升级的黑科技。     扫描一下，立刻就可以进行改装。     什么，你以为我这是中巴车？     其实我这是可以在怪物丧尸中横冲直撞，还能变形的超级基地车。     不但防弹防丧尸，里面还有卧室、厨房、淋浴间，还能发电。     末世是苦难，但江流石却过得逍遥自在，任凭外面僵尸如潮，江流石有大餐吃，有软床睡，任凭你生无可恋的校花美女，上来住几天也会对生命充满希望。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('129', '崩坏召唤', '隐语者', null, '/image/16/16335/16335s.jpg', '不死不灭的吞魂者，一次次“被召唤”。    一句让无尽世界无数人战栗的话开始流传：“你就是老子的玛斯塔？”', null, '2018-09-01 17:41:25', '3', '3', '0'), ('130', '电弧中的高级玩家', '大脸猫脸大', null, '/image/18/18383/18383s.jpg', '专业维修核潜艇，核弹头翻新,改装,抛光,喷漆.回收二手航母,大修核反应堆,、清洗航母油槽、航天飞机保养换三滤.高空作业擦洗卫星表面除尘.星球设计，批发歼10，F22 F35 B2轰炸机，各类核弹头。量大从优！貌似……我原来的本职只是个美术生啊！ps:读者起义，业余码字，幻想作品，请勿较真！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('131', '美漫修仙实录', '黑灯夏火', null, '/image/19/19272/19272s.jpg', '乘船偷渡到哥谭市境内的华裔少年意外觉醒了前世身为元婴期修士的记忆，从此过上了拳打阿卡姆敬老院，脚踢九头蛇幼儿园的喧嚣人生。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('132', '电影世界大盗', '七只跳蚤', null, '/image/16/16545/16545s.jpg', '窃玉者诛，窃国者侯，盗窃一方世界又何如！\n    穿梭电影世界，盗女主，盗宝物，盗一方气运，无所不盗。\n    主角们一个个哭喊着：\n    “我的大气运！”\n    “我的大造化！”\n    “我的女神！”\n    方孝玉冷笑挥手：一切都是我的。\n    大盗系统在身，无数年后，赫然发现女主环绕，气运加身。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('133', '绝命手游', '奥比椰', null, '/image/4/4222/4222s.jpg', '玩手游在家日赚三百！而且是预付！《恐怖城》，号称史上最恐怖的手游。新晋奶爸金轲进入游戏的目的很简单，想要靠手游养活他自己和六个月大的女儿。后来他才发现，这款手游比它声称的更加恐怖。因为……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('134', '虐杀', '一江秋月', null, '/image/10/10155/10155s.jpg', '艾立天赋为零，无法修炼战士。但是无意间进入一款游戏《虐杀原形》。从此，他踏上了与怪物、丧尸、外星怪兽搏斗的成神之路。    游戏中的进化点，可以在现实中强化身体。    游戏中进化出来的钢爪、利刃、拳便、装甲，在现实中成为他的护身法宝。    游戏中的墓尖灭杀、致命痛楚、万千触须——终结一切，使他成为现实中，绝对逆天的存在……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('135', '恐怖广播', '纯洁滴小龙', null, '/image/10/10358/10358s.jpg', '“听众朋友们，欢迎收听【恐怖广播】，希望您能够好好享受我们节目陪伴你的时光，好了，下面，请您转过头，看一看你的身后，兴许，我们今天故事里的主角，就是您。”\n    ————\n    恐怖三部曲之《恐怖广播》，小龙出品，必属精品！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('136', '诡神冢', '焚天孔雀', null, '/image/16/16469/16469s.jpg', '孤苦无依的失业青年陈智，本以为他的潦倒人生已经完全没有了希望。但偶然的机会，让他找到一张十六年前的纸条。从而找回了真实的自己，发现他并不平凡，而是如此卓越。他运用上天赋予他的能力，找到了传说中神灵们的坟墓，揭开了神灵真实诡异的面目，得到神灵的宝藏。\n    上古神书《封神录》真的存在么？谁拥有了它，谁就能找到神灵之墓。\n    “灵血封穴，神子殉葬”，真实的神灵似乎没有传说中那么神圣。     交流群535422468第一个书迷当管理员', null, '2018-09-01 17:41:25', '3', '3', '0'), ('137', '摸金天师', '风尘散人', null, '/image/18/18128/18128s.jpg', '原名《活人回避》一件古董将我推上一条亡命之路，从此为了活下去我变成了一个和阴人行尸打交道的走阴人。三年寻龙，十年点穴，游走阴阳，专事鬼神。走着走着，也就挣扎到了今天。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('138', '特殊事件专案组', '伴读小牧童', null, '/image/11/11815/11815s.jpg', '如果有什么事情是一个不会死的主角无法解决的，那么就来三个。     当三个近乎不会死的人凑在一起时，创造的奇迹其实远没有创造的糗事多、发生的故事远没有发生的事故多。更多更多的快乐和更少更少的悲伤，这其实才是值得追求的东西。生存？荣耀？地位？这种事情不如留给那些中二的年轻人好了。做人嘛，最重要的是开心。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('139', '阴阳代理人之改命师', '黑岩暗丶修兰', null, '/image/0/162/162s.jpg', '七岁，我以为我会和普通的孩子一样长大，工作，成家，但是因为误碰了一个葫芦，而放出了不干净的东西，改变了我的一生。\n    命运，在普通人看来玄奥奇诡，但是对于我来说，这是我吃饭的本钱。\n    命师，一群能够换命，改命之人！\n    百年富贵命格，千年帝皇命格，万年奇仙之命我一路追寻命格，一路走遍华夏大地，神话时代遗留的悬案，古皇陨落之谜，千年僵尸，万年阴司之难，我将为你展现出绝不一样的华夏大地，我将带领你看见这个世界最不可告人的一面。\n    我，就是改命师！\n    我的新浪微博：http://wei', null, '2018-09-01 17:41:25', '3', '3', '0'), ('140', '我是一具尸体', '黑岩杨云', null, '/image/0/234/234s.jpg', '我割腕自杀，鲜血流尽成为干尸。尸身被葬进祖传铜棺，在阴历七月14出殡的那天，怪事穷出。\n    半夜我以干尸之身醒来，全身肌体枯竭，只有鲜血才能够维持我肌体的鲜活。\n    我以人的意志驾驭着我的尸体，我穿梭阴阳，我爱过，我恨过，我杀过人，我灭过鬼。。\n    我是尸体，只要进食血液，我将永远不会衰老，我站在这个世界的最高处俯望，只看到了欲望。\n    这是我的故事，这是我的传记。。。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('141', '深夜书屋', '纯洁滴小龙', null, '/image/19/19325/19325s.jpg', '一家只在深夜开门的书屋，欢迎你的到来………………', null, '2018-09-01 17:41:25', '3', '3', '0'), ('142', '劫天运', '浮梦流年', null, '/image/2/2458/2458s.jpg', '我从出生前就给人算计了，五阴俱全，天生招厉鬼，懂行的先生说我活不过七岁，死后是要给人养成血衣小鬼害人的。\n    外婆为了救我，给我娶了童养媳，让我过起了安生日子，虽然后来我发现媳妇姐姐不是人……\n    从小苟延馋喘的我能活到现在，本已习惯逆来顺受，可唯独外婆被人害死了这件事。\n    为此，我不顾因果报应，继承了外婆养鬼的职业，发誓要把害死她的人全都送下地狱。\n    新书期暂时一天两更，往后只能看成绩再说了，跪谢。\n    浮梦的QQ群号：70794397', null, '2018-09-01 17:41:25', '3', '3', '0'), ('143', '窥天神测', '桃花渡', null, ' ', '言者，心生也，字者，心化也，一个人写出的字，与自己的吉凶祸福等命运有千丝万缕的联系，因此，“测字算命”应运而生，踏上这条路，要从我无意中掉进奶奶的棺材，却在发现里面有个衣衫凌乱的大姑娘说起……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('144', '死亡游戏', '奈何啊', null, ' ', '你们玩过抢红包的游戏吗？陌生人的红包千万不要乱抢，否则……', null, '2018-09-01 17:41:25', '3', '3', '0'), ('145', '我是个阴阳符师', '七麒', null, '/image/12/12970/12970s.jpg', '一个人碰见一次灵异事件并不难，难的是一辈子碰见灵异事件，我叫薛伟，我就是这样的一个人，我是个阴阳符师，我会画符。继《鬼宗师》《与鬼厮混的日子》《星期五有鬼》之后的第四本灵异小说，精彩继续，欢迎品藏。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('146', '阴缘难逃', '尤晓茗', null, '/image/17/17493/17493s.jpg', '比我的祖宗十八代还要早的祖宗，在N年前输了一场赌局，【请追书??】竟将几百年后的我输给了一个少亡男鬼做冥婚，从此我便踏上了与鬼同行的不归路。\n    “三岔路口的索命女鬼，”，“修学旅行中遇到的美女和她的蛇蛋，”.....“博物馆里能渗出尸油让人基因魔化的人骨化石，”.....还有湖边美艳如斯的嗜血美人鱼。”遇到各路妖魔鬼怪来刷我下线啊。\n    这还不够，他竟然还让我怀了他的鬼子，我走到哪里，哪里就一定会有妖魔鬼怪来杀我，我简直成了所有鬼怪都想要害死的香饽饽，这还是人的生活吗！这生活过的简直就是防鬼保卫', null, '2018-09-01 17:41:25', '3', '3', '0'), ('147', '位面破坏神', '卒印', null, '/image/5/5912/5912s.jpg', '武侠、动漫、仙侠，历经各个位面。以破界珠为本，以大执念为宗，破碎万界，随心所欲。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('148', '十月蛇胎', '银花火树', null, '/image/18/18357/18357s.jpg', '一场重病，让我怀胎十月，孩子他爹是条蛇：东北出马仙，一个女弟马的真实故事……新书求暖，大家喜欢的话，有钻石、有票票的都投给银花吧，打滚卖萌！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('149', '阴阳旅店', '黑岩墨白秋', null, '/image/17/17400/17400s.jpg', '我一出生便有阴兵上门拘魂，八岁便来到阴阳旅店，做起了渡阴人的职业，从此不仅渡阴还渡人，每一个来到阴阳旅店的鬼魂或者活人，都有着不可告人的秘密。阴阳旅店有着奇怪的规矩，阴魂必须要签一纸契约，活人必须要在店内住上一宿，不管所求之事是否办成，都一律不退还报酬，不过即便如此，来的客人还是络绎不绝。200钻石加一更，1000推荐票加一更，打赏超过10000加一更。喜欢的记得点追书哟，方便下次继续观看。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('150', '养鬼为祸', '黑岩浮梦流年', null, '/image/0/172/172s.jpg', '我从出生前就给人算计了，五阴俱全，天生招厉鬼，懂行的先生说我活不过七岁，死后是要给人养成血衣小鬼害人的。\n    外婆为了救我，给我娶了童养媳，让我过起了安生日子，虽然后来我发现媳妇姐姐不是人\n    从小苟延馋喘的我能活到现在，本已习惯逆来顺受，可唯独外婆被人害死了这件事。\n    为此，我不顾因果报应，继承了外婆养鬼的职业，发誓要把害死她的人全都送下地狱。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('151', '恶灵国度', '弹指一笑间0', null, '/image/15/15405/15405s.jpg', '继《恐怖通缉令》《极具恐怖》后，一笑的第三本灵异小说《恶灵国度》，惊悚来袭！群号：468930903     光明散去，黑夜降临，窥探着我们每一个人的梦境。     事实的真相被虚假捆缚在冰冷的角落里，偶尔有人发现它，但总会莫名的遗忘。     猫眼里露出的血色瞳孔，午夜窗前跳动的裙摆，还有黑暗中……正不断逼近你的恐怖身影！     困兽之斗，恶灵来袭，绝望一触即发！     无数让人毛骨悚然的事件接连袭来，是在绝望中沉沦？还是在绝望中奋起？     还是残忍等待着来自命运的宣判？     这是属于恶灵的', null, '2018-09-01 17:41:25', '3', '3', '0'), ('152', '麻衣神算子', '骑马钓鱼', null, '/image/3/3916/3916s.jpg', '爷爷教了我一身算命的本事，却在我帮人算了三次命后，离开了我。\n    从此之后，我不光给活人看命，还要给死人看，更要给……\n    更新：每天中午12点之前一更，下午四点之前一更，加更的话，都在晚上\n    加更：一玉佩加一更，一皇冠加十更（皇冠加更会分期完成）\n    求收藏，求推荐，求打赏，求一切哦……\n    需要龙套的，在龙套楼里留名哦。\n    本书QQ群： 253793230，欢迎加入哦！！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('153', '御鬼者传奇', '沙之愚者', null, '/image/16/16767/16767s.jpg', '【老沙的话;94天更新百万字目标达成！下一个目标：200天更新200万字，请大家多多支持，老沙拜谢↖(^ω^)↗（如无意外，2016全年爆发365万字更新）】**********************玄幻、奇幻、武侠、仙侠、都市职场、历史长河、游戏、竞技、科幻、灵异，御鬼者的足迹与冒险将留在这些世界的每一个角落！一个分卷，就是一场新的传奇！！抱歉，这本书不是什么灵异的小众文……它是网文世界中的——百科全书！！收藏本作，你将会看到所有分类小说的内容，会在一部书中尽现，敬请广大读者拭目以待！********', null, '2018-09-01 17:41:25', '3', '3', '0'), ('154', '死城', '黑岩月骁', null, '/image/17/17605/17605s.jpg', '在本书中，我将带你去寻找那些隐藏在城市中的诡异东西，那些生活中骇人的禁忌。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('155', '武动乾坤', '天蚕土豆', null, '/image/1/1872/1872s.jpg', '武之极，破苍穹，动乾坤！\n    主角：天蚕土豆\n    各位书友要是觉得《武动乾坤》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('156', '很纯很暧昧', '鱼人二代', null, '/image/3/3105/3105s.jpg', '杨明原本会是这个世界里普普通通的一员，出生，成长，学习，工作，在生活的艰辛中磨灭自己的志气与理想。但有一天，他得到一份神奇的礼物，从此，生命开始丰富多彩。\n    如果有了足够的能力，你会做什么？他的答案是，让周围的人活得比之前更幸福。能力越大，责任越大。注：本书纯属虚构，如有雷同，那不可能。\n    各位书友要是觉得《很纯很暧昧》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！\n    各位书友要是觉得《很纯很暧昧》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('157', '武侠重生', '大帅匪', null, '/image/8/8514/8514s.jpg', '神级玩家林逸穿越到《大江湖》游戏中。    这里有无数耳熟能详的门派－－－－少林、武当、峨眉、全真、华山、嵩山、衡山、恒山、泰山、桃花岛、明教、日月神教、青城......    还有许多传说中的绝世神功－－－－九阳真经、九阴真经、斗转星移、六脉神剑、凌波微步、太极神功、降龙十八掌、易筋经、北冥神功、八荒六合唯我独尊功、独孤九剑、葵花宝典......    此时正值朝廷微弱，江湖乱战的时代。    为了守护自己珍视的东西——    林逸踏入了江湖！    这是一个少年在乱战江湖中逐渐成长，最终纵横江湖，成为', null, '2018-09-01 17:41:25', '3', '3', '0'), ('158', '网游之近战法师', '蝴蝶蓝', null, '/image/1/1882/1882s.jpg', '一个超级武者,在玩网游时误选了法师,习惯以暴制暴,以力降力的他,只能将错就错,摇身一变,成为一个近战暴力法师,当力量与法术完美结合时,一条新的游戏之路,被他打开了!\n    火球术？闪电链？寒霜冰镜……等等，我是来练功夫的，法术关我什么事？我是法师？哦，对，我是法师。不过……你真的坚信我是法师？好吧，看刀！看剑！看拳！看暗器！什么？你又说我不是法师？如果你不相信，我证明给你看；如果你相信，我表演给你看:法师会功夫，谁也挡不住！\n    各位书友要是觉得《网游之近战法师》还不错的话请不要忘记向您QQ群和微博', null, '2018-09-01 17:41:25', '3', '3', '0'), ('159', '无限恐怖', 'zhttty', null, '/image/0/278/278s.jpg', '生化危机、异形、咒怨、猛鬼街、死神来了……一切的一切，在这深沉如地狱的恐怖中，我……只想活下去！\n    各位书友要是觉得《无限恐怖》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('160', '斗罗大陆', '唐家三少', null, '/image/1/1958/1958s.jpg', '唐门外门弟子唐三，因偷学内门绝学为唐门所不容，跳崖明志时却却发现没有死，反而以另外一个身份来到了另一个世界，一个属于武魂的世界，名叫斗罗大陆。这里没有魔法，没有斗气，没有武术，却有神奇的武魂。\n    各位书友要是觉得《斗罗大陆》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('161', '无限进化', '不冷', null, '/image/5/5031/5031s.jpg', '数百年前，代号为“T”的生物病毒为人类文明开启了毁灭之门，吹响了末日的号角。末日之门就此开启，无数强悍并且狡猾的生物开始肆虐地球，人类生存岌岌可危！自此，地球也正式告别第五纪元——“人类文明纪元”，进入了第六纪元——“混乱纪元”。而这，正是一个发生在混乱纪元的故事………………蚂蚁力量，螳螂之刃，飞蝗之翼，甲虫之铠，虫族的力量将会何等可怕？异形，母皇，铁血战士，怪形，当这些幻想中的凶兽降临于世，将会掀起怎样的腥风血雨？…………【加更规则】钻石满一千一更，宝剑一更，玉佩两更，皇冠20更。【更新规则】①一般下午', null, '2018-09-01 17:41:25', '3', '3', '0'), ('162', '重生之官路商途', '更俗', null, '/image/3/3683/3683s.jpg', '一个自控力超强的新时代超级好男人，一不小心重生去了90年代，还成了个身心均很健康的青春期小屁孩，所以遇到御姐、萝莉、姐妹花神马的，真是压力山大！\n    好在，还有纠缠不清的官场、商场那些事儿，能让张恪权力以对、大战拳脚，至于白手起家创建商业帝国……当然更是手到擒来！\n    作为一个开银行、办酒店、染指互联网、顺手牵羊迪士尼的财团总裁，成年人张恪告诉你：发家致富的捷径只在于六个字——打通权贵之门！\n    各位书友要是觉得《重生之官路商途》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！\n    各', null, '2018-09-01 17:41:25', '3', '3', '0'), ('163', '修神外传', '小段探花', null, '/image/3/3756/3756s.jpg', '神图合，惊雷鸣，禁地动，仙府出！    仙道茫茫路何方？神迹隐,隐为何？    天道无情人有情，万般欲念阻长生！    内念无忧经，外练天雷身，独闯三洲四海，勇战妖魔鬼怪！    手拿五行如意通天棍，扫荡妖魔无可挡！脚踏九星逐梦剑！万里河山一日间！    其貌不扬混凡尘！内中乾坤谁可陈！    龙脉隐动，凤体赐福！天道星空引前路！    前种因，后结果，冥冥之中机缘定！    修道法，悟佛经，塑妖躯，练魔兵，凝剑意，召神魂！    神鬼辟让，妖魔惊退！名动四方，威震八荒！    天雷滚滚惊天下，光遁无声逆', null, '2018-09-01 17:41:25', '3', '3', '0'), ('164', '神墓', '辰东', null, '/image/2/2009/2009s.jpg', '我的新书《长生界》上传了，将会强烈的冲击你的感观，这是一本完全超越神墓的书，会带给你无限精彩。大.....\n    各位书友要是觉得《神墓》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('165', '龙蛇演义', '梦入神机', null, '/image/0/285/285s.jpg', '不为大众熟悉的非常世界——黑帮争斗、黑拳搏命、国际大鳄绞杀他国经济与政治的秘密，尽被原本怯懦而又平凡的混混儿揭开。\n    他，就是，王超。\n    结缘秘密组织唐门掌舵人唐紫尘后，王超靠着非凡的毅力与顿悟一步步走上武学巅峰，拳战各派武学大师，加入又背叛神秘组织，游走于各方势力之间。\n    王超将演绎一个怎样波诡云谲的传奇，铸就怎样一段曲折离奇的人生！！\n    各位书友要是觉得《龙蛇演义》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('166', '魔兽剑圣异界纵横', '天蚕土豆', null, '/image/1/1173/1173s.jpg', '土豆新书已经发出来了：斗破苍穹。\n    请大家支持，下面有直通车，各位，请看看吧，如果觉得满意，请收藏与推荐，谢谢支持，感激不尽^_^\n    各位书友要是觉得《魔兽剑圣异界纵横》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！\n    各位书友要是觉得《魔兽剑圣异界纵横》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('167', '长生界', '辰东', null, '/image/2/2011/2011s.jpg', '我的新书《遮天》上传了，不一样的震撼与精彩，请各位书友支持。—————————————————————世上谁人能不死？任你风华绝代，艳冠天下，到头来也是红粉骷髅；任你一代天骄，坐拥万里江山，到头来也终将化成一抔黄土。不过，关于长生不死的传说却始终流传于世。故老相传，超脱于人世间之外，有一个浩大的长生界……长生界简体正版图书第7集已上市，关于购买说明详见内文，包括邮购及电话等————4月7日留。\n    各位书友要是觉得《长生界》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('168', '大魔王', '逆苍天', null, '/image/1/1349/1349s.jpg', '懦弱少年，一步步超越自我，走向邪恶、走向魔王的传说……\n    ******************************\n    小逆新书《杀神》正式上传，书号：1911245，点下面的直通车可以到达，相信大家会喜欢。\n    各位书友要是觉得《大魔王》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！\n    各位书友要是觉得《大魔王》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('169', '回到明朝当王爷', '月关', null, '/image/4/4179/4179s.jpg', '【起点第四编辑组签约精品】\n    阴差阳错间，乌龙九世善人郑少鹏回到了大明正德年间。\n    那是一个多姿多彩的时代，既有京师八虎的邪恶，又有江南四大才子的风流，还有大儒王阳明的心学，再加上荒诞不经的正德皇帝朱厚照。浑浑噩噩中踏进这个世界的主角，不得不为了自己的命运，周旋在这形形色色的人物之中。\n    东厂、西厂、内厂、外廷之间的纷争；代天巡狩清除贪官的故事；剿倭寇、驱鞑靼、灭都掌蛮、大战佛郎机；开海禁、移民西伯利亚……，精彩的故事纷至沓来……\n    国家和个人的命运，就象历史长河中的一条船，因为他', null, '2018-09-01 17:41:25', '3', '3', '0'), ('170', '斗破苍穹', '天蚕土豆', null, '/image/1/1999/1999s.jpg', '这里是属于斗气的世界，没有花俏艳丽的魔法，有的，仅仅是繁衍到巅峰的斗气！想要知道异界的斗气在发展到巅峰之后……\n    各位书友要是觉得《斗破苍穹》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！', null, '2018-09-01 17:41:25', '3', '3', '0'), ('171', '天下', '高月', null, '/image/4/4176/4176s.jpg', '重回大唐，争霸天下\n    天宝五载，大唐建国已过百年，经历的近数十年的治国，已知天命的李隆基有些疲惫了，自从他册封了杨氏为贵妃后，他的心思也渐渐地离开了枯燥而繁琐的朝政。\n    ‘欢歌慢舞凝丝竹，尽日君王看不足。’\n    他开始纵情于音乐歌舞之中，从此皇帝不再早朝．．．．．．\n    而就在这年的春天，安西的粟楼烽戍堡来了一名新人，一名后世而来的穿越者，先入戍边军旅，外拒狄夷初现峥嵘，再送公主进京，踏入大唐权利中心。短短的时光，他从一个后世的铁血男儿，变成了一位智勇双全的盛世英雄。\n    这是一部', null, '2018-09-01 17:41:25', '3', '3', '0'), ('172', '师士传说', '方想', null, '/image/2/2577/2577s.jpg', '从小在垃圾星长大的叶重，在一次垃圾山的“淘宝”中意外地发现一架残破的光甲。在这架有着智能的残破光甲的帮助下，叶重逃离了垃圾星，进入人类社会。\n    智能光甲牧殇的真实身份，叶重的身世究竟是怎么回事？野兽与美人之间远异于常人的交流方式，眼中只有生存的叶重又是如何经历他的爱情？未知的社会，他是如何一步步熟悉？扮演着何种角色？迥异于人类社会的丛林法则，又给他的命运带来了怎样的转折？\n    拥有光脑般冷静的头脑，信奉残酷丛林法的少年，如海绵一般疯狂学习各种知识，无论是师士，还是在格斗、调培方面都是如此的出色。', null, '2018-09-01 17:41:25', '3', '3', '0'), ('173', '隐杀', '愤怒的香蕉', null, '/image/3/3569/3569s.jpg', '嗯，首先，这是一本完全按照香蕉的邪恶思维来发挥的毒草类书籍，讲述的是一位杀手重生后发生的一系列故事。\n    总之，这本书是一本纯粹轻松的YY小说，充满了大量轻松和扮猪吃老虎的情节，思想淫荡而邪恶的人请进来，这里会满足你的各种需要，思想纯洁而正派的人请去看香蕉的另一本书《异域求生日记》，书号101600，那里会满足你们的另外一些需要。\n    上面未曾提到的一些邪恶元素，有兴趣的可以补充讨论。\n    我们的口号是，没有最邪恶，只有更邪恶！\n    根据某些人让偶换简介的意见，个人认为这应该算是一个比较无', null, '2018-09-01 17:41:25', '3', '3', '0'), ('174', '造化之门', '鹅是老五', null, '/image/0/72/72s.jpg', '这是一个支离破碎的角落，这是一个被遗忘的世界。     那一天，是宁城最失意的时候，那一天，他被硬生生的带到了这里。     这个角落因为有了宁城，将在浩瀚星空中留名，这个世界也因为有了宁城，将在无尽宇宙中精彩！', null, '2018-09-01 17:41:25', '3', '2', '0'), ('175', '冒牌大英雄', '七十二编', null, '/image/2/2561/2561s.jpg', '一个机械修理兵能做什么，研究、改装、奇思妙想？\n    一个机甲战士能做什么，机甲战斗、精妙操作、奇拳怪招？ 一个特种侦察兵能做什么，深入敌后、徒手技击、一招制敌、伪装、潜行、狙击？ 一个军事参谋能做什么，战局推演、行动计划、出奇制胜？ 能把三种职业合而为一,甚至还精通心理学,骗术，刺客伪装术的天才.却是一个胆小怕事，猥琐卑劣的胖子。 当这个奇怪的家伙被迫卷入一场战争中，他会怎么做？他会成为英雄还是狗熊？\n    各位书友要是觉得《冒牌大英雄》还不错的话请不要忘记向您QQ群和微博里的朋友推荐哦！\n    ', null, '2018-09-01 17:41:25', '3', '3', '0'), ('176', '锦衣夜行', ' ', null, '/image/3/3957/3957s.jpg', '唐赛儿！不要把白莲教那些装神弄鬼的把戏教给小盆友嘛,会跟你学坏的.小盆友,你叫什么名字，什么？让娜·达克！圣……圣女贞……贞……，赛儿，我不是叫你。嘿嘿，小让娜，来大叔带你去看鲸鱼。不是不是，大叔教你偷梁换柱、瞒天过海、金蝉脱壳……\n    有神马用？当然有用，你为什么要放羊、挤羊奶、织羊毛袜子呢？对滴，大叔教你的本事也是为了生存。\n    靖难削藩，迁都修典，五征蒙古，七下南洋，我无处不在，却无人知道我在。\n    乾坤入袖，锦衣夜行，低调！低调才是王道。主角：月关\n    各位书友要是觉得《锦衣夜行》', null, '2018-09-01 17:41:25', '3', '3', '0');
COMMIT;

-- ----------------------------
--  Table structure for `hslib_classes`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_classes`;
CREATE TABLE `hslib_classes` (
  `class_id` int(11) NOT NULL COMMENT '分类ID',
  `education` varchar(255) DEFAULT NULL COMMENT '教育：教材；外语；考试；中小教辅；工具书',
  `novel` varchar(255) DEFAULT NULL COMMENT '小说：中国当代；中国近代；中国古典；四大名著；港澳台武侠；外国；推理悬疑；恐怖惊恐；魔幻；科幻；武侠；军事；情感；社会；都市；乡土；职场；财经；官场；历史；影视小说；作品集；世界名著；',
  `art` varchar(255) DEFAULT NULL COMMENT '艺术：文学；传记；艺术；摄影',
  `youth_literature` varchar(255) DEFAULT NULL COMMENT '青春文学；',
  `child` varchar(255) DEFAULT NULL COMMENT '童书：0-2；3-6；7-10；11-14；百科；绘本；文学；英语',
  `social_science` varchar(255) DEFAULT NULL COMMENT '人文社科',
  `economic_science` varchar(255) DEFAULT NULL COMMENT '经管',
  `success` varchar(255) DEFAULT NULL COMMENT '成功励志',
  `livehood` varchar(255) DEFAULT NULL COMMENT '生活:两性；孕期；育儿；亲子家教；保健；运动；美妆；手工；美食；旅游；休闲；家居；风水',
  `techology` varchar(255) DEFAULT NULL COMMENT '科技：科普；建筑；医学；计算机；农林；自然科学；工业',
  PRIMARY KEY (`class_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
--  Table structure for `hslib_dict`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_dict`;
CREATE TABLE `hslib_dict` (
  `dict_enty` varchar(6) DEFAULT NULL COMMENT '字典项',
  `dict_code` varchar(20) DEFAULT NULL COMMENT '字典代码',
  `dict_name` varchar(120) DEFAULT NULL COMMENT '字典描述',
  `flag` varchar(1) DEFAULT NULL COMMENT '状态'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='字典表';

-- ----------------------------
--  Table structure for `hslib_feedback`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_feedback`;
CREATE TABLE `hslib_feedback` (
  `feedback_id` int(11) NOT NULL COMMENT '评论注释表主键id',
  `book_id` int(11) DEFAULT NULL,
  `person_id` int(11) DEFAULT NULL,
  `marks` float(5,0) DEFAULT NULL COMMENT '分数',
  `remark` varchar(255) DEFAULT NULL COMMENT '评论',
  `if_best` varchar(2) DEFAULT NULL COMMENT '是否最佳评论',
  PRIMARY KEY (`feedback_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='评论表，用来记录还书后的评论，评分等。';

-- ----------------------------
--  Table structure for `hslib_order_fined`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_order_fined`;
CREATE TABLE `hslib_order_fined` (
  `fined_id` int(11) NOT NULL COMMENT '罚款id',
  `person_id` int(11) DEFAULT NULL,
  `book_id` int(11) DEFAULT NULL,
  `fined_amount` varchar(255) DEFAULT NULL COMMENT '罚款金额',
  `fined_date` datetime DEFAULT NULL COMMENT '收费日期',
  `operator_id` int(11) DEFAULT NULL COMMENT '收费员',
  PRIMARY KEY (`fined_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='延期还书罚款表。';

-- ----------------------------
--  Table structure for `hslib_order_line`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_order_line`;
CREATE TABLE `hslib_order_line` (
  `order_id` int(11) NOT NULL,
  `line_id` int(11) NOT NULL,
  `order_status` varchar(255) DEFAULT NULL COMMENT '订单状态',
  `comment_id` int(11) DEFAULT NULL COMMENT '评论id',
  `fined_fee_id` int(11) DEFAULT NULL COMMENT '延期罚款id',
  `delay_status` varchar(255) DEFAULT NULL COMMENT '是否延期',
  `delay_days` int(11) DEFAULT NULL COMMENT '延期天数',
  `is_last_line` varchar(255) DEFAULT NULL COMMENT '是否最新一条数据',
  `order_date` datetime DEFAULT NULL COMMENT '借阅时间(预约则表示订单时间)',
  `return_date` datetime DEFAULT NULL COMMENT '还书时间',
  `operatorpersion_id` int(11) DEFAULT NULL COMMENT '操作员id',
  `real_return_date` datetime DEFAULT NULL COMMENT '实际还书日期',
  `description` varchar(255) DEFAULT NULL COMMENT '描述。取消时，取消原因。后续其他可以增加',
  `if_deleted` varchar(2) DEFAULT NULL COMMENT '是否删除，删除Y，空或者其他表示没有删除',
  PRIMARY KEY (`order_id`,`line_id`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='借书还书行表，记录历史流水，操作动作';

-- ----------------------------
--  Records of `hslib_order_line`
-- ----------------------------
BEGIN;
INSERT INTO `hslib_order_line` VALUES ('1', '1', '1', null, null, null, null, 'Y', '2018-09-01 18:24:00', null, null, null, null, null);
COMMIT;

-- ----------------------------
--  Table structure for `hslib_order_main`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_order_main`;
CREATE TABLE `hslib_order_main` (
  `order_id` int(11) NOT NULL AUTO_INCREMENT,
  `book_id` int(11) DEFAULT NULL,
  `person_id` int(11) DEFAULT NULL,
  `order_status` varchar(255) DEFAULT NULL COMMENT '1预约，2借出，3续借，(-1 取消预约,-2借出归还,-3续借归还)',
  `order_datetime` datetime DEFAULT NULL,
  `is_delay` varchar(255) DEFAULT NULL COMMENT '是否延期',
  `operatorpersion_id` int(255) DEFAULT NULL COMMENT '操作员，还书，借书管理员操作',
  PRIMARY KEY (`order_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

-- ----------------------------
--  Records of `hslib_order_main`
-- ----------------------------
BEGIN;
INSERT INTO `hslib_order_main` VALUES ('1', '1', '3', '1', '2018-09-01 18:24:00', null, null);
COMMIT;

-- ----------------------------
--  Table structure for `hslib_person`
-- ----------------------------
DROP TABLE IF EXISTS `hslib_person`;
CREATE TABLE `hslib_person` (
  `person_id` int(255) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `person_name` varchar(255) DEFAULT NULL,
  `sex` varchar(255) DEFAULT NULL,
  `mail` varchar(255) DEFAULT NULL,
  `use_status` varchar(255) DEFAULT NULL COMMENT '是否有效，可以被注销掉',
  `use_role` varchar(255) DEFAULT NULL COMMENT '角色，是否是管理员',
  `account_balance` int(255) DEFAULT NULL COMMENT '账户余额',
  `balance_freezed` int(255) DEFAULT NULL COMMENT '冻结金额',
  `experience` int(255) DEFAULT NULL COMMENT '经验值',
  `fines_total` int(255) DEFAULT NULL COMMENT '累计罚款',
  PRIMARY KEY (`person_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='人物表';

-- ----------------------------
--  Records of `hslib_person`
-- ----------------------------
BEGIN;
INSERT INTO `hslib_person` VALUES ('3', '用户9fa4f', '1', '1224318598@qq.com', null, '0', '100', '20', '100', '0');
COMMIT;

-- ----------------------------
--  View structure for `hslib_book_show_v`
-- ----------------------------
DROP VIEW IF EXISTS `hslib_book_show_v`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `hslib_book_show_v` AS select `s`.`book_name` AS `book_name`,`s`.`author` AS `author`,`s`.`left_amount` AS `left_amount`,`s`.`picture` AS `picture`,(select ifnull(avg(`t`.`marks`),0) from (`hslib_book_comment` `t` join `hslib_books` `b`) where ((`t`.`book_id` = `b`.`book_id`) and (`s`.`booksets_id` = `b`.`booksets_id`))) AS `marks`,(select ifnull(count(1),0) from (`hslib_book_liked` `l` join `hslib_books` `b`) where ((`l`.`book_id` = `b`.`book_id`) and (`s`.`booksets_id` = `b`.`booksets_id`))) AS `like_num`,(select ifnull(count(1),0) from (`hslib_book_comment` `t1` join `hslib_books` `b`) where ((`t1`.`book_id` = `b`.`book_id`) and (`s`.`booksets_id` = `b`.`booksets_id`))) AS `comment_num`,`s`.`booksets_id` AS `booksets_id`,`s`.`class_id` AS `class_id`,`s`.`description` AS `description`,`s`.`update_time` AS `update_time`,`s`.`is_recommend` AS `is_recommend`,`s`.`total_amount` AS `total_amount` from `hslib_booksets` `s` where (`s`.`on_off_shelf` = '0');

-- ----------------------------
--  View structure for `test_view`
-- ----------------------------
DROP VIEW IF EXISTS `test_view`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `test_view` AS select `hslib_book_class`.`book_id` AS `book_id`,`hslib_book_class`.`class_id` AS `class_id`,`hslib_book_tree`.`sub_classid` AS `sub_classid` from (`hslib_book_class` join `hslib_book_tree`) where (`hslib_book_class`.`book_id` = `hslib_book_tree`.`class_id`);

-- ----------------------------
--  Procedure structure for `AutoCheck`
-- ----------------------------
DROP PROCEDURE IF EXISTS `AutoCheck`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `AutoCheck`(OUT `p_error_type` int)
BEGIN

	/*
	自动扫描，检查订单状态包括：
	          1 customer预定书籍时，没有及时取书，导致自动取消
						2 过期未还书的数据，更新订单头状态
	*/

declare v_order_id ,v_line_id ,v_booksets_id,v_person_id ,v_book_id int DEFAULT 0;
declare done int;	
	# 创建游标，并存储数据
declare cur_id CURSOR for    
   select m.order_id,m.person_id,s.booksets_id,m.book_id
     from hslib.hslib_order_main m ,hslib.hslib_books s
    where m.order_status = '1' #预约
     and s.book_id = m.book_id 
	   and DATEDIFF(now(),m.order_datetime) > 7;
	
# 游标中的内容执行完后将done设置为1
 DECLARE CONTINUE HANDLER FOR NOT FOUND SET done=1; 
# 打开游标
open cur_id;
# 执行循环
  posLoop:LOOP
# 判断是否结束循环
		IF done=1 THEN  
      LEAVE posLoop;
    END IF; 
# 取游标中的值
    FETCH  cur_id into v_order_id,v_person_id,v_booksets_id,v_book_id;
# 执行操作
     update hslib.hslib_order_line set is_last_line = 'N'
      where order_id = v_order_id and is_last_line = 'Y'; 

     select max(line_id) into v_line_id from hslib.hslib_order_line where order_id = v_order_id;
#插入一条最新的数据，状态为取消订单
     insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id)
		   values (v_order_id,v_line_id+1,'-1','Y',now(),-1);#使用程序自动运行，更改人设置成-1
			 
			  #需要更新数据，将图书馆中的该书总数量增加一
			update hslib_booksets set left_amount = left_amount+1 
			where booksets_id = v_booksets_id;
			
			#人员的冻结金额数据减少 20 
			update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			#更改书本的状态
			update hslibs.hslib_books set order_status = '-1' where book_id = v_book_id;
    
  END LOOP posLoop;
# 释放游标
set p_error_type = 1 ;#默认为1，表示错误的。
	
#更改订单状态
	update hslib.hslib_order_main m 
	set m.order_status = '0'	#取消预约
	where m.order_status = '1' #预约
	and DATEDIFF(now(),m.order_datetime) > 7;
#第一部分数据处理逻辑处理完毕

#第二部分数据处理，到期的数据，更改主订单状态 行数据状态，天数
update hslib.hslib_order_main m 
	set m.is_delay = 'Y'	#延期
	where m.order_id in 
	(select l.order_id from hslib.hslib_order_line l
	  where l.is_last_line = 'Y'
		and l.order_status in ('2','3')
		and l.return_date < now())
	and m.order_status in ('2','3');#借出或者续借的书
	
update 	hslib.hslib_order_line l
set l.delay_days = datediff(now(),l.return_date),l.delay_status = 'Y'
where l.is_last_line = 'Y'
 and l.order_status in ('2','3')
 and l.return_date < now();
set p_error_type = 0 ;#设置为成功状态
	commit;


END
 ;;
delimiter ;

-- ----------------------------
--  Procedure structure for `ConsoleOperate`
-- ----------------------------
DROP PROCEDURE IF EXISTS `ConsoleOperate`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `ConsoleOperate`(IN `p_order_id` int,IN `p_operate_type` int,IN `p_operatorpersion_id` int,IN `p_message` VARCHAR(255),OUT `p_error_type` int)
BEGIN
/*
借阅管理，后台操作员使用界面，主要功能点3个：取消预定；确定借书出库；还书入库。
返回消息状态 默认为1（失败）成功则为0

*/


DECLARE ord_num ,v_order_id ,v_line_id ,v_booksets_id,v_book_id ,v_person_id ,v_fined_fee_id INT DEFAULT 0;

declare fine_no int default  0; #单独设置一变量表示是否存在罚款的数量
declare fine_amount int default 0;#罚款金额，默认为0 
set p_error_type = 1 ;#默认为1，表示错误的。
#获取书籍id
select b.booksets_id ,m.person_id,m.book_id into v_booksets_id ,v_person_id,v_book_id
from hslib_books b,hslib_order_main m
where b.book_id = m.book_id
and m.order_id = p_order_id
;

	#控制台操作将图书出库 2，确定还书 -2，取消订单 -1 
	if p_operate_type = 2 then #借出图书,图书出库
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '1';#已经预约状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '2',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '1';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line set is_last_line = 'N' 
			 where order_id = p_order_id and is_last_line = 'Y';
			 
			 #图书借出，增加一条记录
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,return_date,operatorpersion_id)
			 values (p_order_id,v_line_id+1,'2','Y',now(),DATE_ADD(now(),INTERVAL 1 MONTH),p_operatorpersion_id);
			 
			 update hslib.hslib_books set order_status = '2' where book_id = v_book_id;
		 end if;
		 set p_error_type = 0 ;#设置为成功状态
	ELSEIF p_operate_type = -1 then #操作员取消预约
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '1';#已经预约状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '-1',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '1';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line set is_last_line = 'N' 
			 where order_id = p_order_id and is_last_line = 'Y';
			 
			 #取消图书预定，增加一条记录
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id,description )
			 values (p_order_id,v_line_id+1,'-1','Y',now(),p_operatorpersion_id, p_description);
			 #增加图书数量，人员的经验取消冻结金额20
			 update hslib_booksets set left_amount = left_amount+1 
			 where booksets_id = v_booksets_id;	
			 
			 update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			 where person_id = v_person_id;
			
			 update hslib.hslib_books set order_status = '-1' where book_id = v_book_id;
		 end if;
	  set p_error_type = 0 ;#设置为成功状态
	ELSEIF p_operate_type = -2 then #还书入库
/*还书，先计算是否有罚款金额，1 有罚款金额；2 无。
1 先计算出，罚款金额，写入罚款行表，设置变量罚款ID v_fined_fee_id 
2不增加记录到行表。

不论是否有罚款数据，均将 v_fined_fee_id 值写到行表 0表示没有关联罚款表

   */
		 #过期的书籍
		 select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id 
		 and is_delay = 'Y'#延期了
		 and (order_status = '3' or order_status = '2') ;#
		 
		 #延期的书籍需要罚款
		 if ord_num > 0 then
			  select count(1) into fine_no 
				from hslib.hslib_order_fined f,hslib.hslib_order_main m
				where f.person_id = m.person_id and f.book_id = m.book_id
				and m.order_id = p_order_id;
				if fine_no > 0 then
				#获取最新的罚款ID，在后面还需要使用默认为0表示没有罚款的id
				   select max(f.fined_id)  into v_fined_fee_id
					 from hslib.hslib_order_fined f,hslib.hslib_order_main m
				   where f.person_id = m.person_id and f.book_id = m.book_id
				   and m.order_id = p_order_id;
				   end if;				 
					 
					 set v_fined_fee_id = v_fined_fee_id + 1;
					 
					 select datediff(now(),l.return_date) into  fine_amount
					 from hslib.hslib_order_line l 
					 where l.order_id = p_order_id
					 and l.is_last_line = 'Y';
					 
		    insert hslib.hslib_order_fined(fined_id,person_id,book_id,fined_amount,fined_date,operator_id)
				select  v_fined_fee_id,m.person_id,m.book_id,fine_amount,now(),p_operatorpersion_id
				from hslib.hslib_order_main m
				where m.order_id = p_order_id				;
				
				#增加借书人员的罚款金额
				update hslib.hslib_person p set p.fines_total = fines_total + fine_amount
				where p.person_id = v_person_id;
		 end if;
	
	   
	   #正常还书
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '2' ;#已经借出状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '-2',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '2';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line 
			 set is_last_line = 'N' , real_return_date = now(),
			     delay_status = case when datediff(now(),return_date)>0 then 'Y' else 'N' end,
					 delay_days = case when datediff(now(),return_date)>0 then datediff(now(),return_date) else 0 end
			 where order_id = p_order_id and is_last_line = 'Y' and order_status = '2';
			 
			 #正常还书，增加一条记录   罚款ID使用的上面获取的，如果上面没有产生罚款，则为0 
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id,fined_fee_id)
			 values (p_order_id,v_line_id+1,'-2','Y',now(),p_operatorpersion_id,v_fined_fee_id);
			 #增加图书数量，人员的经验取消冻结金额20
			 update hslib_booksets set left_amount = left_amount+1 
			 where booksets_id = v_booksets_id;	
			 
			 update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			update hslib.hslib_books set order_status = '-2' where book_id = v_book_id;
		 end if;
		 
		 #续借后还书
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '3' ;#已经续借状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '-3',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '3';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line 
			 set is_last_line = 'N' , real_return_date = now(),
			     delay_status = case when datediff(now(),return_date)>0 then 'Y' else 'N' end,
					 delay_days = case when datediff(now(),return_date)>0 then datediff(now(),return_date) else 0 end
			 where order_id = p_order_id and is_last_line = 'Y' and order_status = '3';
			 
			 #续借图书还书，增加一条记录
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id,fined_fee_id)
			 values (p_order_id,v_line_id+1,'-3','Y',now(),p_operatorpersion_id,v_fined_fee_id);
			 #增加图书数量，人员的经验取消冻结金额20
			 update hslib_booksets set left_amount = left_amount+1 
			 where booksets_id = v_booksets_id;	
			 
			 update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			update hslib.hslib_books set order_status = '-3' where book_id = v_book_id;
		 end if;
		 set p_error_type = 0 ;#设置为成功状态
	END IF;
	commit;

END
 ;;
delimiter ;

-- ----------------------------
--  Procedure structure for `CustomOrdered`
-- ----------------------------
DROP PROCEDURE IF EXISTS `CustomOrdered`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `CustomOrdered`(IN `p_book_id` int,IN `p_person_id` int,IN `p_order_type` int,OUT `p_error_type` int)
BEGIN
/*
传入参数中的p_order_type数据使用 1（预定） 2（借书出库） 3（续借） -1（取消预定） -2（还书入库） -3（续借的书还书入库） 
本过程使用到的参数主要有 1  3  -1三个值。
*/
DECLARE ord_num ,v_order_id ,v_line_id ,v_booksets_id INT DEFAULT 0;
select booksets_id into v_booksets_id from hslib_books where book_id = p_book_id;
#确认借书，客户借书，传进来的参数是1 

set p_error_type = 1 ;#默认为1，表示错误的。
if p_order_type = 1 then  
#客户端下订单，预约书籍。
#先判断是否存在借书以及订单的情况
 		select count(1) into ord_num
 		from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id;
 		if ord_num > 0 then
 		update hslib.hslib_order_main set order_status = '1' where person_id = p_person_id and book_id = p_book_id;
 		else
 		#增加一条预定的记录
			insert into hslib.hslib_order_main(book_id,person_id,order_status,order_datetime)
			values (p_book_id,p_person_id,'1',NOW());
			end if;
			select order_id into v_order_id
			from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id;
	
	#判断是否含有数据
			select count(1) into ord_num 
			from hslib.hslib_order_line where order_id = v_order_id ;
			if ord_num > 0 then
			#原订单数据存在
			select max(line_id) into v_line_id from hslib.hslib_order_line where  order_id = v_order_id ;
			else
			set v_line_id = 0;
			end if ;
			#避免数据重复使用控制,重复数据保护
 		 select count(1) into ord_num 
			from hslib.hslib_order_line 
			where order_id = v_order_id 
			and line_id = v_line_id and is_last_line = 'Y' and order_status = '1'; 
			#已经有数据了，不需要重复下单
	
			if ord_num = 0 then
	
			#将之前订单行数据全部更新为非最新
			update hslib.hslib_order_line set is_last_line = 'N' where order_id = v_order_id and is_last_line = 'Y';
	
			#做一个的动作就往行表里面写一条记录，时间记录为预约时点
			insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date)
			values (v_order_id,v_line_id+1,'1','Y',now());
			#需要更新数据，将图书馆中的该书总数量减少一
			update hslib_booksets set left_amount = left_amount-1 
			where booksets_id = v_booksets_id;
			
			#人员的冻结金额数据增加 20 
			update hslib.hslib_person set balance_freezed = balance_freezed +20 
			where person_id = v_person_id;
			
			#更改书本状态
			update hslib.hslib_books set order_status = '1' where book_id = v_book_id;
			end if;
	set p_error_type = 0 ;#运行结束数据表示正确		
	ELSEIF p_order_type = -1 then  #客户取消订单,取消借阅
			  #先处理订单
		select count(1) into ord_num  
		from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		and order_status = '1';
		if ord_num > 0 then 
		   select order_id into v_order_id 
		     from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		     and order_status = '1';
				 
		   update hslib.hslib_order_main set order_status = '0' ,order_datetime = now()
			 where person_id = p_person_id and book_id = p_book_id and order_status = '1';
			 
				 #将该订单下面的订单行数据全部更新为历史
				 update hslib.hslib_order_line set is_last_line = 'N' 
				 where order_id = v_order_id and is_last_line = 'Y'; 
				 #获取最新的一条数据
				 select max(line_id) into v_line_id from hslib.hslib_order_line where  order_id = v_order_id ;
				 #插入一条最新的数据，状态为取消订单
				 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date)
				 values (v_order_id,v_line_id+1,'-1','Y',now());
				 
				 #需要更新数据，将图书馆中的该书总数量增加一
			update hslib_booksets set left_amount = left_amount+1 
			where booksets_id = v_booksets_id;
			
			#人员的冻结金额数据减少 20 
			update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			#更改书本状态
			update hslib.hslib_books set order_status = '-1' where book_id = v_book_id;
		end if;
	set p_error_type = 0 ;#运行结束数据表示正确	
	ELSEIF 	p_order_type = 3 then  #客户续借图书
	   #判断目标数据是否合理
		/* select count(1) into ord_num  
		 from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		 and order_status = '3';
		 if ord_num > 0 then
		   leave lable_end ;
		 #系统仅仅允许客户续借一次图书
		 end if ;
	   #null;
		 */
		 #判断目标数据是否存在，
		 select count(1) into ord_num  
		 from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		 and order_status = '2';
		 if ord_num > 0 then
		 #存在，修改订单main信息，
		 select order_id into v_order_id 
		     from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		     and order_status = '2';
				 
		 update hslib.hslib_order_main set order_status = '3' ,order_datetime = now()
		 where person_id = p_person_id and book_id = p_book_id and order_status = '2';
		 
		 #存在，修改行信息，新增一条记录到行表		 
		 update hslib.hslib_order_line set is_last_line = 'N' 
				 where order_id = v_order_id and is_last_line = 'Y'; 
				 
		select max(line_id) into v_line_id from hslib.hslib_order_line where  order_id = v_order_id ;
		#插入一条最新的数据，状态为续借图书
		insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,return_date)
				 values (v_order_id,v_line_id+1,'3','Y',now(),DATE_ADD(now(),INTERVAL 1 MONTH));	 
		
   #更改书本状态
			update hslib.hslib_books set order_status = '3' where book_id = v_book_id;
		
		 end if;
		 
set p_error_type = 0 ;#运行结束数据表示正确	
	end if;
		
	
	#存储过程最后，提交事务
	
	commit;
	

END
 ;;
delimiter ;

-- ----------------------------
--  Procedure structure for `insertperson`
-- ----------------------------
DROP PROCEDURE IF EXISTS `insertperson`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `insertperson`(IN `persion_id` int)
BEGIN
	
	insert into person  values (persion_id);

END
 ;;
delimiter ;

-- ----------------------------
--  Procedure structure for `NewProc`
-- ----------------------------
DROP PROCEDURE IF EXISTS `NewProc`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `NewProc`(IN `persion_id` int)
BEGIN
	
	insert into person  values (persion_id);

END
 ;;
delimiter ;

-- ----------------------------
--  Procedure structure for `p_AutoCheck`
-- ----------------------------
DROP PROCEDURE IF EXISTS `p_AutoCheck`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `p_AutoCheck`(OUT `p_error_type` int)
BEGIN

	/*
	自动扫描，检查订单状态包括：
	          1 customer预定书籍时，没有及时取书，导致自动取消
						2 过期未还书的数据，更新订单头状态
	*/

declare v_order_id ,v_line_id ,v_booksets_id,v_person_id ,v_book_id int DEFAULT 0;
declare done int;	
	# 创建游标，并存储数据
declare cur_id CURSOR for    
   select m.order_id,m.person_id,s.booksets_id,m.book_id
     from hslib.hslib_order_main m ,hslib.hslib_books s
    where m.order_status = '1' #预约
     and s.book_id = m.book_id 
	   and DATEDIFF(now(),m.order_datetime) > 7;
	
# 游标中的内容执行完后将done设置为1
 DECLARE CONTINUE HANDLER FOR NOT FOUND SET done=1; 
# 打开游标
open cur_id;
# 执行循环
  posLoop:LOOP
# 判断是否结束循环
		IF done=1 THEN  
      LEAVE posLoop;
    END IF; 
# 取游标中的值
    FETCH  cur_id into v_order_id,v_person_id,v_booksets_id,v_book_id;
# 执行操作
     update hslib.hslib_order_line set is_last_line = 'N'
      where order_id = v_order_id and is_last_line = 'Y'; 

     select max(line_id) into v_line_id from hslib.hslib_order_line where order_id = v_order_id;
#插入一条最新的数据，状态为取消订单
     insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id)
		   values (v_order_id,v_line_id+1,'-1','Y',now(),-1);#使用程序自动运行，更改人设置成-1
			 
			  #需要更新数据，将图书馆中的该书总数量增加一
			update hslib_booksets set left_amount = left_amount+1 
			where booksets_id = v_booksets_id;
			
			#人员的冻结金额数据减少 20 
			update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			#更改书本的状态
			update hslibs.hslib_books set order_status = '-1' where book_id = v_book_id;
    
  END LOOP posLoop;
# 释放游标
set p_error_type = 1 ;#默认为1，表示错误的。
	
#更改订单状态
	update hslib.hslib_order_main m 
	set m.order_status = '0'	#取消预约
	where m.order_status = '1' #预约
	and DATEDIFF(now(),m.order_datetime) > 7;
#第一部分数据处理逻辑处理完毕

#第二部分数据处理，到期的数据，更改主订单状态 行数据状态，天数
update hslib.hslib_order_main m 
	set m.is_delay = 'Y'	#延期
	where m.order_id in 
	(select l.order_id from hslib.hslib_order_line l
	  where l.is_last_line = 'Y'
		and l.order_status in ('2','3')
		and l.return_date < now())
	and m.order_status in ('2','3');#借出或者续借的书
	
update 	hslib.hslib_order_line l
set l.delay_days = datediff(now(),l.return_date),l.delay_status = 'Y'
where l.is_last_line = 'Y'
 and l.order_status in ('2','3')
 and l.return_date < now();
set p_error_type = 0 ;#设置为成功状态
	commit;


END
 ;;
delimiter ;

-- ----------------------------
--  Procedure structure for `p_ConsoleOperate`
-- ----------------------------
DROP PROCEDURE IF EXISTS `p_ConsoleOperate`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `p_ConsoleOperate`(IN `p_order_id` int,IN `p_operate_type` int,IN `p_operatorpersion_id` int,IN `p_message` VARCHAR(255),OUT `p_error_type` int)
BEGIN
/*
借阅管理，后台操作员使用界面，主要功能点3个：取消预定-1；确定借书出库2；还书入库-2。
返回消息状态 默认为1（失败）成功则为0

*/


DECLARE ord_num ,v_order_id ,v_line_id ,v_booksets_id,v_book_id ,v_person_id ,v_fined_fee_id INT DEFAULT 0;

declare fine_no int default  0; #单独设置一变量表示是否存在罚款的数量
declare fine_amount int default 0;#罚款金额，默认为0 
set p_error_type = 1 ;#默认为1，表示错误的。
#获取书籍id
select b.booksets_id ,m.person_id,m.book_id into v_booksets_id ,v_person_id,v_book_id
from hslib_books b,hslib_order_main m
where b.book_id = m.book_id
and m.order_id = p_order_id
;

	#控制台操作将图书出库 2，确定还书 -2，取消订单 -1 
	if p_operate_type = 2 then #借出图书,图书出库
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '1';#已经预约状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '2',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '1';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line set is_last_line = 'N' 
			 where order_id = p_order_id and is_last_line = 'Y';
			 
			 #图书借出，增加一条记录
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,return_date,operatorpersion_id)
			 values (p_order_id,v_line_id+1,'2','Y',now(),DATE_ADD(now(),INTERVAL 1 MONTH),p_operatorpersion_id);
			 
			 update hslib.hslib_books set order_status = '2' where book_id = v_book_id;
		 end if;
		 set p_error_type = 0 ;#设置为成功状态
	ELSEIF p_operate_type = -1 then #操作员取消预约
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '1';#已经预约状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '-1',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '1';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line set is_last_line = 'N' 
			 where order_id = p_order_id and is_last_line = 'Y';
			 
			 #取消图书预定，增加一条记录
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id,description )
			 values (p_order_id,v_line_id+1,'-1','Y',now(),p_operatorpersion_id, p_message);#p_message
			 #增加图书数量，人员的经验取消冻结金额20
			 update hslib_booksets set left_amount = left_amount+1 
			 where booksets_id = v_booksets_id;	
			 
			 update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			 where person_id = v_person_id;
			
			 update hslib.hslib_books set order_status = '-1' where book_id = v_book_id;
		 end if;
	  set p_error_type = 0 ;#设置为成功状态
	ELSEIF p_operate_type = -2 then #还书入库
/*还书，先计算是否有罚款金额，1 有罚款金额；2 无。
1 先计算出，罚款金额，写入罚款行表，设置变量罚款ID v_fined_fee_id 
2不增加记录到行表。

不论是否有罚款数据，均将 v_fined_fee_id 值写到行表 0表示没有关联罚款表

   */
		 #过期的书籍
		 select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id 
		 and is_delay = 'Y'#延期了
		 and (order_status = '3' or order_status = '2') ;#
		 
		 #延期的书籍需要罚款
		 if ord_num > 0 then
			  select count(1) into fine_no 
				from hslib.hslib_order_fined f,hslib.hslib_order_main m
				where f.person_id = m.person_id and f.book_id = m.book_id
				and m.order_id = p_order_id;
				if fine_no > 0 then
				#获取最新的罚款ID，在后面还需要使用默认为0表示没有罚款的id
				   select max(f.fined_id)  into v_fined_fee_id
					 from hslib.hslib_order_fined f,hslib.hslib_order_main m
				   where f.person_id = m.person_id and f.book_id = m.book_id
				   and m.order_id = p_order_id;
				   end if;				 
					 
					 set v_fined_fee_id = v_fined_fee_id + 1;
					 
					 select datediff(now(),l.return_date) into  fine_amount
					 from hslib.hslib_order_line l 
					 where l.order_id = p_order_id
					 and l.is_last_line = 'Y';
					 
		    insert hslib.hslib_order_fined(fined_id,person_id,book_id,fined_amount,fined_date,operator_id)
				select  v_fined_fee_id,m.person_id,m.book_id,fine_amount,now(),p_operatorpersion_id
				from hslib.hslib_order_main m
				where m.order_id = p_order_id				;
				
				#增加借书人员的罚款金额
				update hslib.hslib_person p set p.fines_total = fines_total + fine_amount
				where p.person_id = v_person_id;
		 end if;
	
	   
	   #正常还书
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '2' ;#已经借出状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '-2',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '2';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line 
			 set is_last_line = 'N' , real_return_date = now(),
			     delay_status = case when datediff(now(),return_date)>0 then 'Y' else 'N' end,
					 delay_days = case when datediff(now(),return_date)>0 then datediff(now(),return_date) else 0 end
			 where order_id = p_order_id and is_last_line = 'Y' and order_status = '2';
			 
			 #正常还书，增加一条记录   罚款ID使用的上面获取的，如果上面没有产生罚款，则为0 
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id,fined_fee_id)
			 values (p_order_id,v_line_id+1,'-2','Y',now(),p_operatorpersion_id,v_fined_fee_id);
			 #增加图书数量，人员的经验取消冻结金额20
			 update hslib_booksets set left_amount = left_amount+1 
			 where booksets_id = v_booksets_id;	
			 
			 update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			update hslib.hslib_books set order_status = '-2' where book_id = v_book_id;
		 end if;
		 
		 #续借后还书
	   select count(1) into ord_num 
		 from hslib_order_main 
		 where order_id = p_order_id and order_status = '3' ;#已经续借状态
	   if ord_num > 0 then
	     update hslib.hslib_order_main 
		   set order_status = '-3',operatorpersion_id = p_operatorpersion_id		 
		   where order_id = p_order_id
		   and order_status = '3';
			 
			 select max(line_id) into v_line_id 
			 from hslib.hslib_order_line where  order_id = p_order_id;
			 
			 update hslib.hslib_order_line 
			 set is_last_line = 'N' , real_return_date = now(),
			     delay_status = case when datediff(now(),return_date)>0 then 'Y' else 'N' end,
					 delay_days = case when datediff(now(),return_date)>0 then datediff(now(),return_date) else 0 end
			 where order_id = p_order_id and is_last_line = 'Y' and order_status = '3';
			 
			 #续借图书还书，增加一条记录
			 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,operatorpersion_id,fined_fee_id)
			 values (p_order_id,v_line_id+1,'-3','Y',now(),p_operatorpersion_id,v_fined_fee_id);
			 #增加图书数量，人员的经验取消冻结金额20
			 update hslib_booksets set left_amount = left_amount+1 
			 where booksets_id = v_booksets_id;	
			 
			 update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			update hslib.hslib_books set order_status = '-3' where book_id = v_book_id;
		 end if;
		 set p_error_type = 0 ;#设置为成功状态
	END IF;
	commit;

END
 ;;
delimiter ;

-- ----------------------------
--  Procedure structure for `p_CustomOrdered`
-- ----------------------------
DROP PROCEDURE IF EXISTS `p_CustomOrdered`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `p_CustomOrdered`(IN `p_book_id` int,IN `p_person_id` int,IN `p_order_type` int,OUT `p_error_type` int)
BEGIN
/*
传入参数中的p_order_type数据使用 1（预定） 2（借书出库） 3（续借） -1（取消预定） -2（还书入库） -3（续借的书还书入库） 
本过程使用到的参数主要有 1  3  -1三个值。
*/
DECLARE ord_num ,v_order_id ,v_line_id ,v_booksets_id ,v_book_id INT DEFAULT 0;
declare v_person_id int ;
set v_person_id = p_person_id;
set v_book_id = p_book_id;
select booksets_id into v_booksets_id from hslib_books where book_id = p_book_id;
#确认借书，客户借书，传进来的参数是1 

set p_error_type = 1 ;#默认为1，表示错误的。
if p_order_type = 1 then  
#客户端下订单，预约书籍。
#先判断是否存在借书以及订单的情况
 		select count(1) into ord_num
 		from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id;
 		if ord_num > 0 then
 		update hslib.hslib_order_main set order_status = '1' , order_datetime = now(),operatorpersion_id = null
		where person_id = p_person_id and book_id = p_book_id and order_status <>'1';
 		else
 		#增加一条预定的记录
			insert into hslib.hslib_order_main(book_id,person_id,order_status,order_datetime)
			values (p_book_id,p_person_id,'1',NOW());
			end if;
			select order_id into v_order_id
			from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id;
	
	#判断是否含有数据
			select count(1) into ord_num 
			from hslib.hslib_order_line where order_id = v_order_id ;
			if ord_num > 0 then
			#原订单数据存在
			select max(line_id) into v_line_id from hslib.hslib_order_line where  order_id = v_order_id ;
			else
			set v_line_id = 0;
			end if ;
			#避免数据重复使用控制,重复数据保护
 		 select count(1) into ord_num 
			from hslib.hslib_order_line 
			where order_id = v_order_id 
			and line_id = v_line_id and is_last_line = 'Y' and order_status = '1'; 
			#已经有数据了，不需要重复下单
	
			if ord_num = 0 then
	
			#将之前订单行数据全部更新为非最新
			update hslib.hslib_order_line set is_last_line = 'N' where order_id = v_order_id and is_last_line = 'Y';
	
			#做一个的动作就往行表里面写一条记录，时间记录为预约时点
			insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date)
			values (v_order_id,v_line_id+1,'1','Y',now());
			#需要更新数据，将图书馆中的该书总数量减少一
			update hslib_booksets set left_amount = left_amount-1 
			where booksets_id = v_booksets_id;
			
			#人员的冻结金额数据增加 20 
			update hslib.hslib_person set balance_freezed = balance_freezed +20 
			where person_id = v_person_id;
			
			#更改书本状态
			update hslib.hslib_books set order_status = '1' where book_id = v_book_id;
			end if;
	set p_error_type = 0 ;#运行结束数据表示正确		
	ELSEIF p_order_type = -1 then  #客户取消订单,取消借阅
			  #先处理订单
		select count(1) into ord_num  
		from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		and order_status = '1';
		if ord_num > 0 then 
		   select order_id into v_order_id 
		     from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		     and order_status = '1';
				 
		   update hslib.hslib_order_main set order_status = '-1' ,order_datetime = now(),operatorpersion_id = null
			 where person_id = p_person_id and book_id = p_book_id and order_status = '1';
			 
				 #将该订单下面的订单行数据全部更新为历史
				 update hslib.hslib_order_line set is_last_line = 'N' 
				 where order_id = v_order_id and is_last_line = 'Y'; 
				 #获取最新的一条数据
				 select max(line_id) into v_line_id from hslib.hslib_order_line where  order_id = v_order_id ;
				 #插入一条最新的数据，状态为取消订单
				 insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date)
				 values (v_order_id,v_line_id+1,'-1','Y',now());
				 
				 #需要更新数据，将图书馆中的该书总数量增加一
			update hslib_booksets set left_amount = left_amount+1 
			where booksets_id = v_booksets_id;
			
			#人员的冻结金额数据减少 20 
			update hslib.hslib_person set balance_freezed = balance_freezed - 20 
			where person_id = v_person_id;
			
			#更改书本状态
			update hslib.hslib_books set order_status = '-1' where book_id = v_book_id;
		end if;
	set p_error_type = 0 ;#运行结束数据表示正确	
	ELSEIF 	p_order_type = 3 then  #客户续借图书
	   #判断目标数据是否合理
		/* select count(1) into ord_num  
		 from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		 and order_status = '3';
		 if ord_num > 0 then
		   leave lable_end ;
		 #系统仅仅允许客户续借一次图书
		 end if ;
	   #null;
		 */
		 #判断目标数据是否存在，
		 select count(1) into ord_num  
		 from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		 and order_status = '2';
		 if ord_num > 0 then
		 #存在，修改订单main信息，
		 select order_id into v_order_id 
		     from hslib.hslib_order_main where person_id = p_person_id and book_id = p_book_id
		     and order_status = '2';
				 
		 update hslib.hslib_order_main set order_status = '3' ,order_datetime = now(),operatorpersion_id = null
		 where person_id = p_person_id and book_id = p_book_id and order_status = '2';
		 
		 #存在，修改行信息，新增一条记录到行表		 
		 update hslib.hslib_order_line set is_last_line = 'N' 
				 where order_id = v_order_id and is_last_line = 'Y'; 
				 
		select max(line_id) into v_line_id from hslib.hslib_order_line where  order_id = v_order_id ;
		#插入一条最新的数据，状态为续借图书
		insert into hslib.hslib_order_line(order_id,line_id,order_status,is_last_line,order_date,return_date)
				 values (v_order_id,v_line_id+1,'3','Y',now(),DATE_ADD(now(),INTERVAL 1 MONTH));	 
		
   #更改书本状态
			update hslib.hslib_books set order_status = '3' where book_id = v_book_id;
		
		 end if;
		 
set p_error_type = 0 ;#运行结束数据表示正确	
	end if;
		
	
	#存储过程最后，提交事务
	
	commit;
	

END
 ;;
delimiter ;

SET FOREIGN_KEY_CHECKS = 1;
